{"id": "SSDB45536", "type": "bungalow", "title": "3 Bedroom Semi-Detached Bungalow For Sale in Bidnija", "price": "€2,495,000", "description": "A grand estate set in the tranquil and peaceful surroundings of Bidnija, ideal for luxury living with spectacular open views, spread over 3000sqm. Access to this beautiful property is through a wide drive-in and a car port area which leads to the annex of this property, the surrounding garden with broad patios and lawns, swimming pool and the pool house ideal setting for outdoor entertaining and relaxing atmosphere. Accommodation offers a large comfortable space with abundance of natural light coming in from the large french doors in all rooms. Ground floor comprises a fully equipped kitchen and a living room, guest bathroom, a large wide hall leading to an exquisite sitting room with a functional fire place combined with the elegant setting of the dining room over looking the pool and garden area. Two double bedrooms, both with an en suite and a terrace, and a spacious master bedroom overlooking the pool and garden area served with an en suite equipped with both a bath and a shower. A separate annex houses a comfortable kitchen/living/dining overlooking the pool and garden area, bathroom and a spiral wooden stair case leading to two main bedrooms. A two car garage also compliments this property, as well as ample parking space in the drive-in and car port area. An exclusive, elegant and lavish home unlike any other.", "details": {"Bathrooms": "4"}, "features": ["Luxuriously Finished", "Finished", "Balcony", "Entertainment Room", "Garden", "Outdoor Area", "Terrace", "Yard", "Air Conditioned", "BBQ Area", "Country View", "Finished Form", "Fireplace", "Fully Furnished", "Own Airspace", "Own Roof", "Sea View"]}
{"id": "240241026-226", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€1,875,000", "description": "BAHAR IC-CAGHAQ- A very well kept, detached bungalow, set on approximately 605sqm situated in one of the most elite location of Bahar ic-Caghaq. Spacious accommodation is in the form of a large entrance hall, formal sitting room, fitted kitchen / living, 3 bedrooms (two of which is an en-suites) main guest bathroom and washroom .This attractive residence further more comprises of a mature garden, swimming pool with ample deck area with an underlying 20 car garage.", "details": {"Size": "603sqm", "Bathrooms": "3"}, "features": ["Deck", "Garden", "Roof (Full)", "Swimming Pool", "Luxury Finish", "Ceramic Flooring", "En Suite", "Entrance Hall", "Kitchen/Dinette", "Interconnected Garage"]}
{"id": "SFDB44956", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bidnija", "price": "€1,500,000", "description": "Fully detached bungalow built on 1.5 tumoli of land, enjoying breathtaking country views and total tranquillity. Property comprises of an entrance hall, a living/dining area, fitted kitchen/breakfast, lounge, three double bedrooms, main bathroom, and a spacious two car garage and access to roof and laundry room through a 20sqm central courtyard. This bungalow is surrounded by 1.2 tumoli of land, with more than ample space for a large pool, deck , BBQ and entertainment area, as well as landscaping. Once renovated property will make an astounding residence.", "details": {"Size": "230sqm", "Bathrooms": "1"}, "features": ["Ordinary Finished", "Yard", "Outdoor Area", "Garage", "Country View", "Own Airspace", "Own Roof"]}
{"id": "509507", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€560,000", "description": "Set on high grounds comes this SEMI-DETACHED BUNGALOW (approx. 230 sqm) which has the possibility to build another floor and washroom. This property is located in a sought after tranquil area of Mellieha and in a cul-de-sac road. Accommodation comprises of a welcoming reception, kitchen and dining area, living room, three bedrooms main with shower en-suite, main bathroom, large back yard with swimming pool, three car carport, one car streel level garage and washroom at roof level. Enjoys distant sea views from roof level. Needs modernisation and once converted will do a lovely family home. Viewings highly recommended. Items Included in Price As per inventory", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Back Yard", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "12756", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Mellieha", "price": "€1,700,000", "description": "luxury fully detached bungalow built on a plot of 1,300 sqmtrs, offering unobstructed seaviews. Layout comprises of an entrance hall, sitting room, dining room, library, study, fitted kitchen/living, nice central courtyard, bathroom, 6 bedrooms, 5 ensuites and large landscaped garden with pool. Property also has 2 car garage and flatlet", "details": {}, "features": []}
{"id": "17605", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bidnija", "price": "€1,500,000", "description": "Fully-detached Bungalow, situated in this tranquil area, built on 1.5 tumoli of land, enjoying unobstructed views. Property consists of a welcoming hall, formal sitting and dining room, kitchen/breakfast area, three double bedrooms, main bathroom, laundry room, two-car street-level garage. Complementing this dream home is approximately 1400 sqm of land with ample space for a large pool and entertaining area.", "details": {}, "features": ["Outdoors"]}
{"id": "17643", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Iklin", "price": "€1,500,000", "description": "Designer finished Bungalow built on a LARGE 600 square meter plot, having a large pool with deck area enjoying full privacy, situated on the outskirts of Iklin in a very quiet location. This property boasts of ample natural light. spacious entrance hall, leading to a very bright living area with a functional wood-burning fire-place, dining area, separate kitchen / breakfast room, 3 double bedrooms with en-suite bathroom and a walk-in closet and stove, guest bathroom, reading area, study, library, terrace with bbq area and laundry. Complementing this property is a 6+ car garage, gym, wine cellar, a one bedroom flat-let. Will sell fast !!", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "226427", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€1,550,000", "description": "Excellently finished elevated BUNGALOW built on circa 1300 sq.m. (1.250 tumoli) of land having excellent unobstructed panoramic views. Accomodation comprises hall, drawing room, living room, dining room, kitchen/breakfast room, 4 double bedrooms (3 with ensuite), luxury bathroom with shower, laundry room, 8 car garage, underlying flat or maid's quarters comprises hall, kitchen, sitting/dining room, bedroom and bathroom. Finally the property offers a large pool,children's pool, pool w.c.,and changing room and surrounding garden with barbecue area. Must be seen.", "details": {}, "features": []}
{"id": "240121068-374", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€2,658,000", "description": "M'SCALA- One of a kind spacious and luxuriously finished semi detached BUNGALOW situated in one of the most prestigious residential areas with breathtaking unobstructed sea views. Being sold fully furnished, this property also comes fully equipped with all modern day gadgets such as a lift operating from garage to the roof, satellite system, marble flooring, Security Alarm Surveillance system, fire place etc. Fully equipped kitchen/b'fast including all appliances, large pool complete with deck and entertaining area. Overlooking pool area is a kitchen/dining/living area. Furthermore on the semi basement level is a fifteen car lock-up garage as well as a car port which accommodates another two cars. Garage is quite modernized with a nice kitchenette & 2 bathrooms.", "details": {"Size": "480sqm", "Bathrooms": "4"}, "features": ["Air Space", "First Time Buyer", "Swimming Pool", "5+ Car Garage"]}
{"id": "TBG10126", "type": "bungalow", "title": "3 Bedroom Terraced Bungalow For Sale in Zejtun", "price": "€452,000", "description": "ZEJTUN - A massive 377sqm Bungalow having a total of 7 rooms, a six car garage and a large private yard with garden at the back. Property is in need of some attention but once renovated will do for an amazing, luxurious estate.", "details": {"Size": "197sqm", "Bathrooms": "1"}, "features": []}
{"id": "000658", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Ta' l-Ibragg", "price": "€2,750,000", "description": "Victoria Gardens (Ibragg) - A highly finished DETACHED BUNGALOW set on 1124 sq m enjoying a good sized swimming pool and entertainment area with open views. Spacious accommodation comprises welcoming hall, lounge/dining, large kitchen/living, 3 bedrooms (master having a large en suite, walk in, private terrace),box room, guest bathroom. The property also has a 3 bed roomed flat let having its own entrance, kitchenette, wine cellar, cinema room. Complimenting this property is a 5 car interconnecting garage with a large drive, solar panels, air conditioning, gym and more. Highly recommended.", "details": {"Bathrooms": "4"}, "features": []}
{"id": "453041", "type": "bungalow", "title": "3 Bedroom Semi-Detached Bungalow For Sale in Attard", "price": "€1,300,000", "description": "Finished and very well kept, SEMI-DETACHED BUNGALOW set on a plot of approx. 460 sqm and located in this much sought after, high end residential area of Attard. Property comprises of a wide entrance hall, formal sitting and dining room, separate kitchen, a spacious outdoor area including a swimming pool and entertaining area. This bungalow also has three double bedrooms main with shower en-suite, family bathroom, two guest shower rooms, laundry room, large basement and a five car interconnected garage.", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Airconditioning", "Shops"]}
{"id": "226318", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€7,000,000", "description": "A DETACHED BUNGALOW, set on approximately 2,360sqm of land, situated in a highly sought after location, commanding unobstructed distant sea-views. Spacious accommodation comprises of an entrance hall, kitchen/dining, a pantry, guest toilet, sitting room, living room, bathroom, office,bedroom with own shower en-suite (ideal for guests/nanny/house-helper), a large swimming pool with ample deck area, lawn and garden. Upstairs, one finds 6 bedrooms (all of which come with shower en-suite facilities) a study, guest toilet and guest apartment. This unique property further comprises an indoor-pool, squash court, gym, sauna, games room and 2 bathrooms (all of which are situated at basement level), a private car port, a large garage and an internal passenger lift servicing all floors. A rare find indeed!", "details": {"Bathrooms": "2"}, "features": []}
{"id": "17549", "type": "bungalow", "title": " Bungalow For Sale in Rabat", "price": "€1,245,000", "description": "An unconverted bungalow in this peaceful area of Rabat, having loads of potential to be converted into a dream home!. 3 bedrooms, a kitchen, a sitting room and a main bathroom. Property includes 2 yards – an internal yard and another yard that leads to the roof which is also being sold.", "details": {}, "features": []}
{"id": "110324", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Gozo - Ghajnsielem", "price": "€950,000", "description": "A truly gem of a home, this BUNGALOW is set on the outskirts of this popular village, enjoying total privacy and tranquillity with its surrounding grounds, built on around 2000 sqm of floor print. Having landscaped gardens, jacuzzi, sauna, large heated pool, large carport and a large roof terrace with a Gazebo and loungers, enjoying distant sea views, where one can chill out and relax. Accommodation offers an entrance onto a small hallway, dining room, three double bedrooms, two en suite and a separate shower/toilet, kitchen/breakfast, study and a separate living area having lovely pattern tiles. All this leads to the pool and deck area with separate shower/toilet and pump room/store room. Complementing this bungalow, is a separate annex having a further three bedrooms with two en suite. All rooms are air conditioned and all leading onto a private landscaped garden and entertaining area. A good investment. Items Included in Price Kitchen", "details": {}, "features": ["Washroom", "Swimming Pool", "Views", "Airconditioning", "Shops"]}
{"id": "SDVLP44591", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Fgura", "price": "€636,000", "description": "A Bungalow set a plot of 392sqm, situated in a wide street and close to amenities. 4+1 area.", "details": {"Size": "276sqm", "Bathrooms": "3"}, "features": ["Unconverted", "Entertainment Room", "Garage", "Internal Yard", "Wash Room", "Yard", "Own Airspace", "Own Roof"]}
{"id": "005AT07404", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€2,870,000", "description": "A recently built and designer finished sea front bungalow enjoying magnificent views. Layout comprises of an entrance hall, large open plan fitted kitchen/breakfast and dining/living area, guest toilet and three bedrooms (all of which have en-suite facilities). This top of the range residence also comprises an outdoor swimming pool overlooking the promenade, a kitchenette, an office, an internal courtyard and a fifteen-car garage at semi-basement level.", "details": {"Bathrooms": "3"}, "features": ["Garage", "Swimming Pool", "Front Garden", "Balconies", "Terrace", "Views"]}
{"id": "18545", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Madliena", "price": "€2,900,000", "description": "MADLIENA - A Detached Bungalow set on 1125 sqm in the best part of Madliena, enjoying unobstructed countryside and sea views. There is the possibility of constructing a further floor, which will convert the property into a fantastic Fully Detached Villa. Square layout currently consists of a welcoming reception hall, a separate kitchen, lounge / TV room, the sitting / dining room and the sleeping quarters. Access to the property is via a large front garden. At the front is also a drive-in which leads to an interconnecting two car garage. Property must be seen to be appreciated !", "details": {"Size": "1100sqm"}, "features": ["Sea View", "Valley View", "Balcony", "Yard", "Garage", "Airspace", "Ground Rent", "Pet Friendly"]}
{"id": "CXGGZ11126", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Gozo - Santa Lucija", "price": "€3,707,000", "description": "Fully Detached BUNGALOW abound by tranquillity while commanding spectacular views of the luscious countryside and distant sea. This exceptional property features an entrance through a private driveway, two replicated mill rooms as lounge areas, a separate kitchen, six bedrooms (two of which enjoy en-suite bath) and two guest showers. Distinguishing this outstanding residence is a massive surrounding outdoor area incorporating a large tiled swimming pool and decking area. Property offers all the comfort ones needs with spacious indoors and outdoors while oozing an aura of charm and luxury throughout. Unique and exclusive in every imaginable way! Viewing is highly recommended!", "details": {"Bathrooms": "4"}, "features": ["Swimming Pool", "Views"]}
{"id": "222", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Attard", "price": "€2,500,000", "description": "A unique residence in this beautiful and tranquil village, rich in history and heritage is a rare opportunity to come across. A fully detached BUNGALOW on 1450sqm One finds the entrance hallway directly onlooking a most wonderful back garden packed with various fruit trees and a large pool, living room, impressive sitting, separate dining room, kitchen/dining, bathroom and three large bedrooms. An imposing mahogany staircase which leads to the top floor were one finds another bedroom This villa is rich in history with its original columns. Possibility to build another floor.Also included in the price are two garages. Must be seen to be fully appreciated.", "details": {"Bathrooms": "3"}, "features": []}
{"id": "296", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Madliena", "price": "€2,330,000", "description": "MADLIENA: A beautiful detached bungalow with surrounding garden set on approximately 1 tumolo of land. It is situated in a very nice and quiet neighbourhood, enjoying breath taking sea views and is in very good shape. This property includes 4 bedrooms (one ensuite), two good sized kitchens, living/dining area, sitting room, study, 2 main bathrooms, a spare shower room and a spacious laundry room. Further in, one walks onto a spacious terrace with a pool and bbq area, perfect for entertaining. Property enjoys plenty of natural light! Underneath, one finds an interconnected 8 car garage as well as a huge storage area (approx 300sqm). Complementing this property are two flatlets both having their own separate entrance, one of which can be used for multiple purposes such as dance/piano studio, clinic, games room, gym etc … This property also has a large well.  This bungalow has plenty of potential. It was built in 1995. The main upstairs area was however finished in 2011. The pool and pump room are just 2 years old! Property is being sold unfurnished.", "details": {"Bathrooms": "3"}, "features": []}
{"id": "240171009-1040", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Ta' l-Ibragg", "price": "€2,750,000", "description": "VICTORIA GARDENS – Immaculately finished, fully Detached Bungalow, set on approximately 1124sqm, commanding picturesque, open views. This unique property comfortably accommodates an imposing entrance hall, sitting dining area, spacious kitchen/breakfast area , three double bedrooms, main with walk-in wardrobe, en-suite and private terrace, and a guest shower room. Property is highly complemented by a massive, surrounding garden, and a large, swimming pool, with a spacious, sunny deck area, till late evening. Further complementing this home, is a totally independent, three bedroom, street level flatlet, also having its own cinema room/gym, and a street-level, five/six car garage. Surely a property that needs to be seen to be appreciated.  240171009-104", "details": {"Size": "1124sqm", "Bathrooms": "2"}, "features": ["Cinema room/gym", "Commands picturesque", "en-suite and private terrace", "five/six car garage", "Immaculately finished", "Imposing entrance hall", "Large", "Main with walk-in wardrobe", "Massive", "Open Views", "Set on approximately 1124sqm", "Sitting/dining", "Spacious kitchen/breakfast", "Spacious sunny deck area", "street level flatlet", "Street-level", "Surrounding garden", "Swimming Pool", "Three bedroom", "Three double bedrooms"]}
{"id": "617595", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Attard", "price": "€820,000", "description": "Spacious finished semi-detached BUNGALOW located in the beautiful area of Misrah Kola. Property consists of three bedrooms, main bathroom, spare shower, kitchen, living and dining room and an additional combined living and dining room that leads onto a garden. At roof level one finds a washroom and ample space to create a beautiful roof garden ideal for entertaining. Further adding value to this property is a three car car-port. Freehold.", "details": {"Bathrooms": "1"}, "features": ["Garden", "Airconditioning", "Shops"]}
{"id": "21433", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Attard", "price": "€800,000", "description": "Attard An Impeccably kept Bungalow,3 bedrooms, living room, kitchen/Dining 2 Bathrooms.The Garage was converted into a living area leading to the garden and yard, but can easily be converted into a studio flat, has a kitchenette and its own entrance. The property is freehold, owns its own airspace ,the roof is very large too.Facility to build another floor.One can parkin the drive, the area is a quiet villa area. There is a washroom on the roof.", "details": {"Size": "270sqm"}, "features": ["Yard", "Garage", "Parking Space", "Garden", "Roof Terrace", "Unfurnished", "Ground Floor", "Open Plan", "Airspace", "Freehold", "Finished", "Whole Roof", "Square Layout"]}
{"id": "SBNG44589", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Fgura", "price": "€636,000", "description": "An unconverted bungalow set on a plot of 376sqm, situated in a wide street and close to amenities. Layout consists of large front patio, entrance area, formal sitting and dining area, kitchen/dining room leading to a sizeable yard, main bathroom, three double bedrooms, en suite, a one car garage and a flat let. First floor comprises of two further rooms and a roof with own air space. Ideal for a luxurious family home or for development.", "details": {"Size": "276sqm", "Bathrooms": "3"}, "features": ["Unconverted", "Entertainment Room", "Garage", "Internal Yard", "Wash Room", "Yard", "Own Airspace", "Own Roof"]}
{"id": "036750", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Ta' l-Ibragg", "price": "€2,750,000", "description": "Highly finished DETACHED BUNGALOW in this sought after area with open views. Spacious acomodation. Comprises welcoming hall, lounge/dining, large kitchen/living, 3 bedrooms (main with private terrace, walk-in wardrobe and large ensuite wth bathroom and shower), guest toilet. Lounge/dining and kitchen l.ead onto a large pool and deck with ample space for entertaining. A five-car garage interconnects with th property. There is a also a 3 bedroomed flatlet with kitchenette and living area with its own entrance. The property also comprises a dinema room with a gym and surrounding garden. Items Included in Price Fireplace in kitchenFlat let - Cinema room, gym, 3 bed, shower room, kitchenette, box room and wine cellar", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Views", "Airconditioning", "Shops"]}
{"id": "CXGGZ11086", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Gozo - Gharb", "price": "€414,000", "description": "A semi-detached BUNGALOW set in this picturesque village abound by tranquillity boasting a wide imposing fa ade and back garden with space for pool/decking area. Property is finished to good standards comprising of a combined kitchen/dining area, living room, three double bedrooms, bathroom, a second living space overlooking the sunny garden and a street level garage. Complementing this remarkable property is the roof terrace offering the potential to build an additional storey. Perfect as a luxury permanent residence or as a Bed and Breakfast. Must be viewed to be appreciated!", "details": {"Bathrooms": "2"}, "features": ["Garage", "Garden", "Shops"]}
{"id": "285", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Naxxar", "price": "€7,000,000", "description": "A Detached Bungalow, set on approximately 2,317sqm of land, currently under construction and to be built in shell form state by end 2017., situated in a highly sought after location, commanding unobstructed distant sea-views. Spacious accommodation comprises of an entrance hall, kitchen/dining, a pantry, guest toilet, sitting room, living room, bathroom, office, a bedroom with own shower en-suite (ideal for guests/nanny/house-helper), a large swimming pool with ample deck area, lawn and garden. Upstairs, one finds 6 bedrooms (all of which come with shower en-suite facilities) a study, guest toilet and guest apartment. This unique property further comprises an indoor-pool, squash court, gym, sauna, games room and 2 bathrooms (all of which are situated at basement level), a private car port, a large garage and an internal passenger lift servicing all floors.", "details": {"Bathrooms": "7"}, "features": []}
{"id": "17475", "type": "bungalow", "title": " Bungalow For Sale in Attard", "price": "€820,000", "description": "A semi detached bungalow in Misrah Kola, Attard. On entering the property you are greeting to a well appointed hall, 3 double bedrooms, two bathrooms, a large kitchen and a cosy living room. There is also a small back yard. The property also has a washroom on the roof. Freehold.", "details": {}, "features": []}
{"id": "036585", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Dingli", "price": "€2,445,000", "description": "Situated on the outskirts of Dingli enjoying views of the countryside is this SEMI DETACHED BUNGALOW, comprising of an entrance hall, kitchen and dining room, 3 bedrooms, bathroom. This property has a large open space that measures approximately 2287 sqm of land that can be turned into a lovely garden and entertaining area. Also having 2 water reservoirs, a Well, Wind Mill and 3 other rooms.", "details": {}, "features": ["Garage", "Views", "Shops"]}
{"id": "617593", "type": "bungalow", "title": "3 Bedroom Semi-Detached Bungalow For Sale in Marsaxlokk", "price": "€650,000", "description": "A beautifully laid out, well kept semi-detached BUNGALOW that captures breathtaking sea views situated in a highly sought after area. Property consists of a welcoming hallway leading to a formal library/study, combined living and dining area, separate kitchen, bathroom, guest toilet, three large bedrooms (main with en suite & walk in wardrobe), washroom and a large back yard offering enough outdoor space for a jacuzzi pool, lounge area and al fresco dining. Property is being sold freehold and with a three car street level lock up garage. Priced to sell.", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Views", "Airconditioning", "Shops"]}
{"id": "240201006-383", "type": "bungalow", "title": "1 Bedroom Bungalow For Sale in Gudja", "price": "€248,000", "description": "GUDJA - Large corner BUNGALOW, situated at a good area in this sought after area village. Layout consists of a large front patio leading to an enormous open-plan kitchen/living/dining, small yard, large room at the back ideal to be converted into a one-car garage and a bathroom. Complimenting this property which is all on ground floor, one finds a full basement measuring the same size of the whole plot. Plot size 18 by 11.3 by 6.5metres. Once developed it will make a beautiful home.", "details": {"Bathrooms": "1"}, "features": ["Yard", "Shell Form", "Inland", "Near Beach"]}
{"id": "TA10289", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Qawra", "price": "€840,000", "description": "Qawra- Located in the best part of Qawra is this site measuring circa 600sqm to build a fully detached Bungalow with swimming pool, and garage. Must be seen!", "details": {"Bathrooms": "2"}, "features": ["Available", "Garage"]}
{"id": "031658", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€5,300,000", "description": "A fully detached, elevated BUNGALOW located in the best part of Bahar ic-Caghaq and set over an area in excess of approximately 2248 sqm . A majestic stairway leads up to the main door and on entering the house one is welcomed by an exceptionally wide hallway. The bungalow comprises a large sitting/dining room, kitchen/living room, pantry, 4 double bedrooms - all with en suite -bathrooms and a large back terrace overlooking the pool area. At ground level one finds a large open plan hall ideal for parties or even weddings, 2 separate flat-lets, a large pool with extensive pool decks, landscaped areas and driveway leading onto a large garage. In addition an optional parking space measuring 1100sqm (approx) is being offered. Items Included in Price Underlying apartment comprising 2 bedrooms, kitchen/dining room, sitting room, bathroom, 3 roomed office and 1 large 90'x59' room. Pool with large deck area, 2 wells, mahogany wood units, chipped marble floors and balcony/terrace with bedroom.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Swimming Pool", "Garden", "Back Yard", "Views", "Airconditioning", "Shops"]}
{"id": "021396", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bidnija", "price": "€1,500,000", "description": "Fully-detached BUNGALOW situated in this tranquil village, built on 1.5 tumoli of land, enjoying total privacy and unobstructed views. Property layout comprising a welcoming entrance hall, formal sitting and dining room, kitchen/breakfast area, three double bedrooms, main bathroom, laundry room, two-car street-level garage and approx 1400 sqm of land with enough space for a large pool and entertaining area. Items Included in Price Fully furnished.", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Views", "Shops"]}
{"id": "W-01ZDBA", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€2,600,000", "description": "A stunning elevated bungalow set in the fantastic area of the island of Malta! This beautiful yet luxurious bungalow also enjoys beautiful and country views. This impeccable property is finished to the highest of standards and allows true luxury living! This elegant Bungalow in Bahar ic-Caghaq comprises of: Large formal sitting / dining with a magnificent terrace with impeccable views, overlooking surrounding gardens, pool and deck area -Kitchen / living area having also access to splendid terraces -Study -Guest bathroom -Spare toilet -Four large double bedrooms of which the main with en-suite and walking wardrobe The lower level has a fantastic set up giving the benefit of sheer relaxation which includes 1 bedroom flat let, gymnasium and an 8/10 car garage. For more information about this lovely bungalow please call for a viewing!", "details": {"Bathrooms": "4"}, "features": ["Garage", "Tiles", "Terrace", "Alarm system", "Accessible for wheelchairs", "jacuzzi", "Swimming pool", "AC", "Basement", "Guest toilet", "Garden", "Balcony", "Sea/lake view", "Built-in Kitchen"]}
{"id": "CXGGZ10734", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Gozo - Gharb", "price": "€650,000", "description": "An immaculately finished fully DETACHED BUNGALOW set in a quiet residential area boasting panoramic country views. This lush property features an entrance hall, lounge/dining area leading to a very large terrace overlooking the superb views, kitchen, three double bedrooms (main with en-suite including shower/hydro jets) and bathroom with Jacuzzi bath. Complementing this property is a separate one bedroom guest quarters with another en-suite. A large swimming pool at roof terrace overlooking the views further enhance this unique residence. Luxury finishing include extra thick double glazed windows, concealed air-conditioning throughout, alarm system, soffit ceilings, intelligent light/sound system and marble floors. Includes an interconnected 3 car garage. Contemporary, luxury living in an idyllic spot! Must be viewed to be fully appreciated!", "details": {"Bathrooms": "1"}, "features": ["Garage", "Swimming Pool", "Front Garden", "Balconies", "Terrace", "Views", "Airconditioning", "Bus Stop", "Shops"]}
{"id": "251", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Marsascala", "price": "€2,660,000", "description": "A recently built and designer finished sea front bungalow enjoying magnificent views. Layout comprises of an entrance hall, large open plan fitted kitchen/breakfast/dining/living, guest toilet and three bedrooms (all of which have en-suite facilities). This top of the range residence also comprises an outdoor swimming pool overlooking the Marsaskala promenade, a kitchenette, an office, an internal courtyard and a fifteen-car garage at semi-basement level.", "details": {"Bathrooms": "6"}, "features": []}
{"id": "283", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,199,000", "description": "MELLIEHA – A very spacious bungalow located in one of Malta’s elite residential areas offering ample entertainment space and is finished. On entrance one finds a large welcoming hall followed by a formal lounge/dining area. Fitted solid kitchen/living/dining room leading to a spacious terrace which keeps surrounding the property also enjoying open views. Following are three double bedrooms. Main bedroom with an en-suite and a walk-in closet. A main bathroom and a washroom and an office. Large games room and a gym. A entertainment area around a large swimming pool with a jacuzzi and a lovely deck area enjoying amazing views, The views from the large mature garden extend as far as Gozo. An 8 car garage and a flatlet compliments this property. A very rare find at a bargain price", "details": {"Bathrooms": "4"}, "features": []}
{"id": "035784", "type": "bungalow", "title": "4 Bedroom Detached Bungalow For Sale in Madliena", "price": "€2,500,000", "description": "Exceptional fully DETACHED BUNGALOW located in Madliena, enjoying lovely sea and country views. This spacious family home is built on approximately 1000 sqm of land and is surrounded by a mature garden and a very large private pool and deck area. The main ground floor accommodation consists of a welcoming hallway, study, guest toilet, spacious sitting and dining room, fitted kitchen/breakfast room with pantry and a living room overlooking the pool area. Sleeping quarters are perfectly laid out were the master bedroom comes with its own walk-in wardrobe and en suite bathroom and three other double bedrooms and a shower room. All bedrooms either overlook the views or the garden. Property is complemented with two basements having a very large games room, a small flat-let with a spacious terrace, storage and a 6-car garage. Freehold.", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Back Yard", "Views", "Shops"]}
{"id": "240071063-399", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Swieqi", "price": "€1,907,000", "description": "Swieqi - Set in this exclusive area, in a quiet street yet close to all amenities, is this fully detached bungalow measuring 445sqm. Property comprising an imposing entrance hall leading to a sitting/dining, kitchen/dining, three bedrooms, main bathroom, boxroom and laundry room. Further complimenting this exciting property is a back garden and two side gardens, three car garage, and another street level garage.", "details": {"Size": "445sqm", "Bathrooms": "3"}, "features": ["Back Yard", "Roof (Full)", "Terrace", "Needs Renovation", "Ceramic Flooring", "Entrance Hall", "Beach", "City Center", "Inland with Views", "Near Church", "Near Fitness centre", "Near Shops", "Outskirts", "Views", "3 Car Garage", "Basement Garage", "Optional Garage"]}
{"id": "W-029SUA", "type": "bungalow", "title": "2 Bedroom Bungalow For Sale in Zebbug", "price": "€2,150,000", "description": "Exclusive with E&V Sara Grech is this bungalow which is located in the heart of the village, in a very quiet area yet close to all main amenities. This property is surrounded by 1,480 sqm of garden with enough space for a swimming pool, bbq and decking area, a separate private garden or tennis court. Other features include: entrance hall separate sitting room kitchen and living room 2 double bedrooms 2 bathrooms yard terrace overlooking the garden street level garage This unique property is ideal for large families and for those who are looking for a home with a massive outside space to host events. For further information, please contact the number provided or visit one of our lounges located around Malta.", "details": {"Size": "235sqm", "Bathrooms": "2"}, "features": ["Garage", "Tiles", "Fireplace", "Terrace", "AC", "Patio", "Garden"]}
{"id": "240041036-68", "type": "bungalow", "title": "3 Bedroom Semi-Detached Bungalow For Sale in Mellieha", "price": "€560,000", "description": "MELLIEHA – Semi-Detached Bungalow, in a sought after location, built on solid foundations, on a plot measuring 11.7m by 21.6m. Property comprises a front patio of approximately 33sqm, a separate, 20sqm sitting room, kitchen/dining, three double bedrooms, (main with en-suite), and a guest bathroom, a good sized, back yard and stairs leading to the washroom and roof. A one-car garage is included.", "details": {"Bathrooms": "2"}, "features": ["33sqm front patio", "Built on solid foundations", "Garage included", "Good sized back yard", "In a sought after location", "Plot measures 11.7x21.6m", "Separate 20sqm sitting room", "Three double bedrooms", "Washroom and roof"]}
{"id": "CXGGZ10808", "type": "bungalow", "title": " Bungalow For Sale in Gozo - Sannat", "price": "€315,000", "description": "Nestled in an alley in this charming village, this one off new built House of character spread on one level boasts a sunny pool surrounded by spacious deck area and a large roof terrace with superb views of half of the island. This rustic finished house comprises of a sunbathed comfortable combined kitchen/living/dining overlooking the pool, two double bedrooms (main with ensuite), main bathroom and traditional spiral stone staircase to roof. This Furnished affordable property is an ideal retreat benefitting from tranquil and serene surroundings.", "details": {}, "features": []}
{"id": "W-029L66", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mellieha", "price": "€2,500,000", "description": "A unique opportunity to acquire a one off freehold fully detached bungalow for sale in Mellieha. Property has been built on solid ground on a plot of land measuring approximately 1500sq .This property for sale in Malta is in an immaculate condition, enjoys a unique layout including a large pool and a garden. Property has many features which include: A large welcoming hall Kitchen Dining Lounge 4 large double bedrooms 4 bathrooms Large pool Good sized Garden 2 car Garage Air-conditioned Property has ample space on the lower level which can be used as a flat-let and playing rooms. Property is highly recommended and must be seen. Call us for viewing today.", "details": {"Bathrooms": "4"}, "features": ["Fireplace", "AC", "Sea/lake view", "Built-in Kitchen"]}
{"id": "16533", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bidnija", "price": "€1,500,000", "description": "Situated in this tranquil and much sought after area location, this corner bungalow enjoys stunning views and sits on 1630 sq mtrs plot. Layout consists of an entrance hall, sitting/dining, main bathroom, 3 bedrooms, kitchen, and own roof. Property needs some work but definately good size and good location For more information call Marise 7927 8517", "details": {}, "features": []}
{"id": "VLA4147", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€2,500,000", "description": "MELLIEHA € 2,500,000. A large fully detached modern BUNGALOW set on high grounds enjoying open breathtaking sea and country views. Accommodation comprises of a wide entrance hall, 3 double bedrooms (main with en-suite), luxury bathroom, living room, large fully equipped fitted kitchen/dining opening onto the pool area, wash room, large surrounding gardens, large overflowing swimming pool, open sun terrace, carport and lock up garage etc. Property is being sold highly finished and fully furnished. Also available for Long Let", "details": {"Bathrooms": "1"}, "features": ["Furnished", "Swimming Pool", "Garden"]}
{"id": "240071097-1665", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Mellieha", "price": "€2,600,000", "description": "A stunning, fully detached, elevated BUNGALOW situated in probably the best part of SANTA MARIJA ESTATE, enjoying spectacular views from every room and its extensive terraces and pool deck. Expertly built, on a total area of approx. 1,200 square meters, solid foundations with lots of attention to detail throughout the property. Living quarters consist of 4 double bedrooms (3 of which have en-suite bathrooms), large kitchen/breakfast, guest bathroom along with separate family living room and study. On a lower floor one finds a large living area, fully fitted kitchen/breakfast, a further 2 double bedrooms, guest bathroom, wine cellar, large indoor pool as well as an outdoor pool with deck and entertainment area. Further complimenting this property is a 6 car garage along with a 6 car drive inn. Must be seen to be fully appreciated.", "details": {"Size": "1200sqm", "Bathrooms": "5"}, "features": ["Air Space", "Balcony", "First Time Buyer", "Garden", "Swimming Pool", "Terrace", "Well", "En Suite", "Entrance Hall", "Fire Place", "Floors - Hardwood", "Kitchen/Dinette", "Video Hall Porter", "Country Views", "Inland with Views", "Near Sea Front", "Open Views", "Sea View", "Valley Views", "Views", "5+ Car Garage", "Car Port", "Interconnected Garage", "ADSL", "Air Conditioning", "Cable TV", "Dishwasher", "Electricity", "Heating", "Jacuzzi", "Microwave", "Phone", "Satellite", "Security Alarm", "Security System", "Washing Machine"]}
{"id": "240261009-63", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Madliena", "price": "€2,500,000", "description": "HIGH RIDGE (MADLIENA) - A unique opportunity to own a bungalow in this exclusive town, set on just under a tumolo of land. Layout affords a welcome hall, leading onto two, separate living/sleeping quarters. On one side, one finds a country style setting, consisting of an open plan kitchen/dining, overlooking the first part of the terrace, two bedrooms, a shower room and a laundry room, which could also be a third bedroom. There is also a separate living room, with distant sea views. On the adjacent side of the hall, accommodation consists of a lounge, an office, the main bathroom, and a double bedroom, with dressing room and en-suite, with access leading onto the pool area, as well as a modern kitchen and separate dining area. At ground level, there is a flat let with surrounding garden, with an interconnecting door to the first level garage with space for approximately six cars, a gym, and a games room. A wide ramp leads to the basement level with space for a further ten cars, ideal for a collector. Property, which has the possibility to build a further floor, has lots of potential for a super home.", "details": {"Bathrooms": "3"}, "features": ["Air Space", "Deck", "Garden", "Swimming Pool", "Yard", "En Suite", "Walk in Wardrobe", "On Quiet Road", "5+ Car Garage", "Basement Garage", "Interconnected Garage"]}
{"id": "603590", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mosta", "price": "€953,000", "description": "Fully detached BUNGALOW built on a large plot of 65ft by 135ft. Spacious split leveled accommodation consists of 4 bedrooms, separate kitchen, sitting room, dining room, living room, bathroom, spare toilet and back garden measuring 56 ft x 20 ft. A drive way leading onto an underlying basement / flatlet is also interconnected to the house. Freehold Items Included in Price Kitchen but no table.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Swimming Pool", "Garden", "Shops"]}
{"id": "750484", "type": "bungalow", "title": "4 Bedroom Detached Bungalow For Sale in Marsaxlokk", "price": "€3,000,000", "description": "A one-of-a-kind detached BUNGALOW in the south of the island, located in the rural and tranquil area of Delimara, spanning a total area of 3 tumoli. Upon approaching this gorgeous property one is welcomed by a beautifully landscaped Mediterranean garden, a 10-car car-port as well as a 4-car garage. Having an imposing entrance, once inside the property, one finds a welcoming reception that immediately opens onto a beautiful sun-filled courtyard leading to the large living and dining room. Owing to its symmetrical layout, a kitchen with access to the pool side is found to the right side of the open plan whereas a generous study with a large bay window enjoying pool, country and sea views is found on the left side. Additionally, there are 4 double bedrooms in this bungalow, 2 on each side of the courtyard, two bathrooms, a laundry and a guest toilet. The property is surrounded by a 5 meter wide garden which opens onto a south-facing terrace, making it perfect for al-fresco entertainment and a pool deck commanding country views stretching all the way to Marsascala and the open seas. From the roof of this property one can also enjoy full 360 degree views of the island.", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "20629", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bidnija", "price": "€1,600,000", "description": "BIDNIJA: A truly one of a kind three bedroom bungalow set in a unique location in the town of Bidnija.  This 1,500 sq/m property comprises of a spacious living/dining room, a kitchen, three double bedrooms and one bathroom. It also has a small internal yard which leads to the roof terrace that entails for a panoramic view of the Mosta Dome, Rabat and Mdina. This bungalow truly possesses magnificent views!  The bungalow is also equipped with a garden and a squarish layout unconverted back yard. Once converted it can include a swimming pool with Jacuzzi, deck area, 'al frecso' dining area and BBQ area. Property also has a two car garage included. Highly recommended for someone who is searching for the perfect family home in a tranquil environment.  TRULY AN AMAZING PROPERTY SET IN ONE OF THE SOUGHT AFTER AREAS IN MALTA! BOOK A VIEWING NOW.", "details": {"Size": "1500sqm"}, "features": ["Swimming Pool", "Valley View", "Yard", "Garage", "Furnished", "Garden", "Field", "Roof Terrace", "Utility Room", "Airspace", "Detached", "Freehold", "Country Views"]}
{"id": "213", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Birguma", "price": "€3,000,000", "description": "BIRGUMA- A unique opportunity to own a FULLY DETACHED bungalow in this exclusive town, set on just under a tumolo of land. Layout affords a welcome hall, leading onto two, separate living/sleeping quarters.From the living area one finds a modernly finished high end open plan kitchen/dining, overlooking unobstructed country views and distant sea views Moving Towards the sleeping quaters one finds four double bedrooms all with ensuite looking over the pool area At ground level, there is a flat let with an interconnecting door to the first level garage with space for approximately six cars, a gym, and a games room. This property has lots of potential for a super home.", "details": {"Bathrooms": "5"}, "features": []}
{"id": "415514", "type": "bungalow", "title": "4 Bedroom Detached Bungalow For Sale in Marsascala", "price": "€2,000,000", "description": "Well positioned fully DETACHED BUNGALOW sitting on approximately 1500 square meters of land, commanding extensive views of M'Scala. This furnished accommodation comes in the form of a hall, sitting room, living room, kitchen and dining area, 4 bedrooms, 2 en-suites, main bathroom, and a 3-car garage with car port. All rooms overlook the surrounding garden/land. PROPERTY IS ALSO TO-LET. Items Included in Price 2 fitted kitchens, fitted items.", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Garden", "Terrace", "Views", "Shops"]}
{"id": "509019", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,750,000", "description": "Unique, designer finished, fully DETACHED VILLA in the up market villa area of Santa Maria Estate, set on over approximately 1000 sqm of land and being sold furnished and ready to move into. Recently built on rock, this bright and airy property having a unique and very practical layout, enjoys distant sea and country views as well as total privacy. Layout in the form of a welcoming entrance hall, large games room and living room on one side and a large 2 car garage on the other side. A lovely staircase takes you to the upper floor where one finds a huge living area, dining area and kitchen and breakfast area, 3 double bedrooms, walk-in wardrobes, 3 en-suite bathrooms, 2 guest's toilets and a laundry room. On the outside one finds a huge front terrace enjoying views, a 30'X20'swimming pool and jacuzzi, BBQ area, ample deck area surrounded by trees, flowers and shrubs, making this a truly magnificent villa. Finishing include double glazing apertures, wood burning fire place, wi-fi throughout, burglar alarm system, gypsum ceilings, under-floor heating, 16 solar panels, solar water heater, VRV air conditioning system and much more. Items Included in Price Open plan kitchen/living/dining, log burning fireplace, pattered floor tiles, limestone walls, marble stairs, heating flooring upstairs, double glazing, reservoir, 16 solar panels, solar heating, jacuzzi with swimming pool, BBQ area + Shower with pool area, walking Robes, Coving, wifi everywhere, Alarm system.", "details": {"Bathrooms": "2"}, "features": ["Washroom", "Garage", "Swimming Pool", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "415516", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Marsascala", "price": "€3,100,000", "description": "Well positioned fully DETACHED BUNGALOW sitting on 3000 sqm of land with ample space for pool and deck area, commanding extensive views; having both residential and commercial possibilities. Accommodation comes in the form of a hall, sitting, living room, kitchen/dining area, 4 bedrooms, 2 en-suites, main bathroom, and a 3-car garage with car port. All rooms overlook the surrounding garden/land. Excellent property offering multiple possibilities. Items Included in Price 2 fitted kitchens, fitted items.", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Terrace", "Views", "Shops"]}
{"id": "Bung15069", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Ghajn Tuffieha", "price": "€2,500,000", "description": "A rare to come by plot of land with 9,000sqm which will feature a beautifully built three bedroom bungalow and pool, 6 car garage and 360 degree unobstructed country and sea views. This amazing find will provide the utmost in tranquility and luxury with an abundance of outdoor space to use at will. The present owners have taken great care in ensuring all permits are in hand and that this stunning new home will provide its future owners with a beautifully designed home. This property, which consists of 200sqm on ground floor and a further 200sqm at basement level is being sold freehold and comes with a huge reservoir, two boreholes and its own cesspit. The basement level offers plenty of storage space and the possibility of utilizing the additional space for recreational use. This project is due to be complete in mid-2018.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Garden", "Pool", "Sea views", "Wine cellar", "Country views"]}
{"id": "STBG43483", "type": "bungalow", "title": "4 Bedroom Terraced Bungalow For Sale in Rabat", "price": "€1,245,000", "description": "Hard to come by, fully detached older type bungalow in one of the little hamlets on the outskirts of Rabat, built on 1.5 tumoli of land and surrounded by ODZ countryside, enjoying spectacular views. Entrance is through a private driveway, which leads to an outer courtyard / parking area. Inside, the layout comprises of a lounge, four bedrooms, two bathrooms, and a separate kitchen/dining room leading to a back yard. An internal stairs lead you to the full roof. This property is further complimented by two two-car garages, and more than enough outdoor space to erect a huge pool and lavish entertainment area. Needs work, but once modernised will make an astounding residence.", "details": {"Size": "300sqm", "Bathrooms": "2"}, "features": ["Unconverted", "Garage", "Garden", "Outdoor Area", "Yard", "Country View", "Own Airspace", "Own Roof", "Sea View"]}
{"id": "13378", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Madliena", "price": "€1,250,000", "description": "A very well built Semi-Detached BUNGALOW built on a plot of 600sqm situated in this sought after area. Accommodation comprises a welcoming entrance hall leading to a dining room, sitting, 3 bedrooms, ensuite, open plan kitchen/breakfast/living overlooking the corner pool and side garden. Complementing this property is a 3 car garage. One can extend further by building an additional floor for more living space. Worth Viewing!!", "details": {}, "features": ["Garage"]}
{"id": "VLA4146", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Ta' l-Ibragg", "price": "€1,995,000", "description": "TA L-IBRAGG € 1,995,000. A fully detached BUNGALOW set on 1 tumolo of land, finished to very high standards, situated in a very quiet residential area close to all amenities. Accommodation comprises an open plan kitchen / sitting / dining area leading to the large swimming pool area with lots of deck area ideal for entertaining, 3 bedrooms all with bathrooms ensuite. This wonderful property enjoys a lovely surrounding garden and an interconnecting lock garage, large basement and drive-in etc.", "details": {"Size": "1189sqm", "Bathrooms": "2"}, "features": ["Swimming Pool"]}
{"id": "240261002-259", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Gharghur", "price": "€2,900,000", "description": "Gharghur. Situated on the outskirts of this lovely quaint village is this magnificent elevated Detached Bungalow capturing fantastic sea and country views. Set on approximately 2,500sqm (0.6 of an acre) of prime land it comprises a welcoming entrance hall leading to a formal sitting room, formal dining room, into the kitchen/breakfast area, living room, guests' bathroom and six bedrooms with en-suite bathrooms. Most of the rooms lead to the outside entertaining area which consists of a large swimming pool, Jacuzzi, sun- deck area, BBQ area with gazebo, tennis court and beautiful surrounding landscaped gardens. One also finds a flatlet and a large garage underneath the property.", "details": {}, "features": ["Garden", "Swimming Pool", "En Suite", "Entrance Hall", "Inland", "Sea View", "Garage"]}
{"id": "19889", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€3,250,000", "description": "MARSASCALA - A unique opportunity to acquire this fantastic BUNGALOW enjoying amazing unobstructed sea views. Lavish property layout consists of a spacious open plan kitchen, living and dining area, 3 double bedrooms each with en-suite facilities, 3 additional separate bathrooms, a very large interconnected basement and garage with space for 6 cars, gym, laundry room and utility room. No expense has been spared in the finishing of this luxury residence. All rooms are flooded with natural light and overlook the outdoor pool and garden area. The property also features a heated indoor pool. Must be viewed to be appreciated!", "details": {"Size": "1120sqm"}, "features": ["Swimming Pool", "Sea View", "Garage", "Air Conditioning", "Jacuzzi", "Garden", "Basement", "Airspace", "Detached", "Freehold", "Whole Roof"]}
{"id": "508018", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Mellieha", "price": "€2,900,000", "description": "A well kept BUNGALOW situated in the best part of Mellieha measuring 400 sqm and built on a tumolo of land, enjoying breathtaking views. All rooms have access to large terraces which lead to the pool and BBQ patio, forming part of the extensive outdoor entertainment area. Property comprises of a large welcoming reception area, kitchen and dining area, living room leading onto the aforementioned terrace, 3 large double bedrooms (master having an en suite shower), a separate main bathroom, 2 storage rooms and a bright study with a skylight. Also forming part of the property, is another 1.4 tumoli of land on which one could build another villa. PROPERTY IS ALSO TO-LET. Items Included in Price Fitted kitchen and appliances", "details": {"Bathrooms": "1"}, "features": ["Garage", "Swimming Pool", "Garden", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "Bung15143", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€1,500,000", "description": "An extremely well kept 1,350sqm bungalow located in the most requested areas of Naxxar. Not only does this bungalow boast priceless open sea and country views but is also full of natural light and airy. Property comprise separate kitchen/breakfast, living/dining, 3 to 4 double bedrooms (2 ensuite), main bathroom, guest bathroom, all rooms leading out on to a large pool/BBQ deck and 2 large pools. At basement level, one finds a fully independent 1 double bedroom flatlet and an interconnecting 6 car lock-up garage. Property is being sold completely finished and freehold. NOT TO BE MISSED!", "details": {"Bathrooms": "5"}, "features": ["Garage", "Dining", "Living", "Kitchen", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Roof", "Sea views", "Fireplace", "Wine cellar", "Terrace", "Flatlet", "Country views", "Utility/boxroom", "Car capacity", "Balcony"]}
{"id": "306646", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mtahleb", "price": "€7,000,000", "description": "Set in one of the most beautiful parts of the Maltese countryside this detached BUNGALOW enjoying fantastic views with swimming pool, tennis court a garden measuring nine tumoli (approx 10116 sqm). Accommodation of the main house comprises hall lounge with an open plan kitchen, dining room, three bedrooms, two en suite bathrooms, main bathroom, large terraces, drive way, games room and two bedroom annex. Also included is a large 10 car garage accessible from a separate drive way at the back of the house. PROPERTY IS ALSO TO-LET. Items Included in Price Fireplace, 9 tumoli of land, reservoir, 10 car garage.", "details": {"Bathrooms": "3"}, "features": ["Garage", "Swimming Pool", "Garden", "Views", "Shops"]}
{"id": "SSDB42807", "type": "bungalow", "title": "4 Bedroom Semi-Detached Bungalow For Sale in Kalkara", "price": "€825,000", "description": "Large, bright and airy detached villa having all rooms on one plan. On entrance one finds a big hall with rooms on both sides, in the form of a formal sitting and dining, main bathroom, guest bathroom, four double bedrooms and a kitchen/living/dining over looking the back terrace. Property features a large well and a three car garage with a car port, a large washroom with a kitchen, living and shower room on roof. Fantastic country and sea views. Plot size 53ft x 100ft.", "details": {"Size": "480sqm", "Bathrooms": "2"}, "features": ["Ordinary Finished", "Finished", "Balcony", "Entertainment Room", "Garage", "Outdoor Area", "Terrace", "Wash Room", "Air Conditioned", "Country View", "BBQ Area", "Finished Form", "Own Airspace", "Own Roof", "Fully Furnished", "Sea View"]}
{"id": "506563", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mellieha", "price": "€1,500,000", "description": "Fully detached BUNGALOW set on high grounds (1,400sqm of land) built on solid rock and has commanding views of most of Santa Maria Estate from its extensive terraces. Spacious accommodation in the form a large combined lounge, dining area, large fitted kitchen and breakfast area, 4 double bedrooms - master with en-suite shower, 2 luxury bathrooms, laundry room, an underlying 2 bedroom flatlet with its own fitted kitchen and breakfast area, bathroom and living room. Property also boasts of a surrounding mature garden, large terraces, large 3/4-car garage, very large and private swimming pool surrounded by an extensive deck area ideal for entertaining. An excellent property.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Swimming Pool", "Garden", "Terrace", "Views", "Shops"]}
{"id": "240261005-14", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Rabat", "price": "€1,600,000", "description": "Country residence, detached bungalow with pool, 1500sqm plot enjoying open country views, very secluded location, ample outside space for entertaining. Property comprises a grand entrance hall, formal sitting/dining, separate fitted kitchen/breakfast, 3 double bedrooms, large study, spacious living room with fireplace and 3 bathrooms. A separate flatlet compliments this property which comprises a huge open lounge, bar area, opposite pool deck, drive in and car port, a 500sqm warehouse/storage area, suitable for stables or further enlarging the outside space. Available outright sale or long let.", "details": {"Size": "1500sqm", "Bathrooms": "3"}, "features": ["Air Space", "Deck", "Roof (Full)", "Swimming Pool", "Terrace", "Yard", "Standard Finish", "Ceramic Flooring", "En Suite", "Entrance Hall", "Fire Place", "Partially Furnished", "Country Side", "Country Views", "Inland with Views", "On Quiet Road", "Open Views", "Outskirts", "5+ Car Garage", "Car Port", "Street Level Garage", "Air Conditioning", "Cooker"]}
{"id": "JST22767", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bidnija", "price": "€1,500,000", "description": "BIDNIJA – Set in this sought after location is this fully detached bungalow offering spacious living conditions. Layout consists of a spacious living and dining area,separate kitchen,Three double bedrooms, main bathroom & interconnected 2 car garage.This property is set on 1500sqm of land with ample space for pool,gardens,landscaping. Freehold", "details": {"Bathrooms": "1"}, "features": ["Partly Furnished", "Airspace", "Backyard", "Country Side", "Country Views", "Courtyard", "Garden", "Near Church", "Quiet Road", "Space for Pool", "Space for Swimming Pool", "Garage included in the price", "Interconnected Garage", "Street Level Garage"]}
{"id": "212282", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€3,500,000", "description": "A rare opportunity to acquire this fantastic BUNGALOW enjoying amazing unobstructed sea views comprising of a spacious open plan kitchen, living, dining area, 3 double bedroom each with en-suite facilities, 3 additional separate bathrooms, car port leading to a 15 car garage interconnected with the residence as well as a good sized pool on the front of the property. Property footprint is approximately 1000 sqm which including a surrounding yard and garden. Must be seen!", "details": {"Bathrooms": "6"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Balconies", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "W-01S3T3", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Birzebbuga", "price": "€4,200,000", "description": "This wonderful example of a farmhouse located on the outskirts of Birzebbugia, enjoys 360 degrees country views. The property is set on 6 tumuli of land, consisting of: A Large open plan Kitchen/living/dining 3 large double bedrooms all situated on ground floor Ample room for entertainment This home benefits from a self contained first floor which comprises of a 1 bedroom apartment. This large estate includes the following luxuries: A swimming pool Jacuzzi, stables A horse track Garage 3 wells A reservoir A borehole The gardens a serviced with an automatic water irrigation system, and includes CCTV system throughout. This spectacular estate must be seen! Call us now to book your viewing!", "details": {"Bathrooms": "3"}, "features": ["Garage", "Tiles", "Fireplace", "Accessible for wheelchairs", "Guest apartment", "jacuzzi", "Swimming pool", "AC", "Guest toilet", "Garden", "Built-in Kitchen"]}
{"id": "W-01GM2B", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€2,900,000", "description": "An exceptional and well finished and planned bungalow situated in a quiet and sought after area of Santa Maria Estate, in Mellieha. The layout of this lovely comprises of: Welcoming entrance hall Large living/dining room overlooking the pool area Separate lounge area Fully fitted kitchen/dining room 3 double bedrooms with main having en-suite Main bathroom Store room Complimenting this beautiful property is a swimming pool with large decking and B.B.Q area overlooking nice sea views, large back garden, two garages and 1 tumolo of land with permit to build another villa next to it. This lovely bungalow is a true gem of the Maltese islands! Make sure you book your viewing!", "details": {"Size": "240sqm", "Bathrooms": "2"}, "features": ["Garage", "Marble", "Terrace", "Swimming pool", "Garden", "Sea/lake view", "Built-in Kitchen"]}
{"id": "240201035-9", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€880,000", "description": "Mellieha - A fully detached bungalow set on a footprint of circa 1,020 SQM built in lime stone and perched ontop of this elite residential area. A sense of space adorns this lovely house dating back to the 80's where all rooms were larger than today's average and most enjoys views of Santa Maria Estate and Mellieha bay. This three bedroom home, includes a large kitchen / breakfast area, formal rooms and a large basement having multiple car spaces, games room, workshop and a flatlet amonst other storage space. A lush garden surrounds the preoperty and offers space for a swimming pool. Property requires modernising, but surely not to be missed.", "details": {"Size": "1435sqm", "Bathrooms": "2"}, "features": ["Location", "Balcony", "Garden", "Roof (Full)", "Terrace", "Well", "Standard Finish", "Old Building", "To Be Renovated", "Entrance Hall", "Sea View", "Valley Views", "Garage", "Electricity", "Water"]}
{"id": "304034", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Gharghur", "price": "€2,900,000", "description": "Opportunity to acquire a fully Detached BUNGALOW enjoying total seclusion, built on 2 tumoli of land (2248 sqm) enjoying fantastic open sea and country views. This 5 bedroom bungalow has very spacious accommodation including a large pool and deck area with BBQ and showers, a private tennis court, an independent flatlet and a 7-car garage. A unique property that is very difficult to come across. Items Included in Price Bedroom area carpeted. Mahogony doors, Air-Conditioning unit in 2 bedrooms and shower area near pool. Tennis court in garden, built in closets in all bedrooms, 2 tumoli of land. Fitted kitchen, alarm + video hall- porter, totally isolated. Independent flatlet with bedroom, bathroom. 7 car garage", "details": {"Bathrooms": "2"}, "features": ["Washroom", "Garage", "Swimming Pool", "Airconditioning", "Shops"]}
{"id": "035693", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Dingli", "price": "€905,000", "description": "Hard to find SEMI-DETACHED BUNGALOW having a footprint of 349sqm located on the outskirts of Dingli and surrounded by countryside. Property is in shell form with an internal layout consisting of an open plan kitchen, living and dining area overlooking the pool deck, master bedroom with walk-in closet and en suite bathroom, another two double bedrooms also with en suite facilities and main bathroom. The lovely home also includes a good sized swimming pool, underlying garage, storage room and two water reservoirs.", "details": {"Bathrooms": "4"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Views", "Shops"]}
{"id": "17048", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€1,270,000", "description": "A highly finished semi detached bungalow located in an elite area build on a plot of app 460 sqms. Property welcomes you into a wide entrance, kitchen/living/dining with terrace overlooking a large back garden with pool and deck area, 3 bedrooms and bathroom. Downstairs one finds a 2 bedroom flatlet and a 5 car garage. Freehold", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "W-01D3MW", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Balzan", "price": "€2,600,000", "description": "An exclusive property in Malta! This luxury real estate is a rare find indeed. Located in the vicinity of San Anton Gardens, this prime real estate is around 1,500sqm. It also forms part of the UCA area in Balzan. This property enjoys great potential as commercial real estate. The property comes in the form of: A regal interior and An abundant mature garden. It comes highly recommended! Call us for a viewing.", "details": {"Size": "500sqm", "Bathrooms": "2"}, "features": ["Terrace", "AC", "Garden"]}
{"id": "PE33", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€1,450,000", "description": "Prime located fully detached Bungalow measuring Approx. 1,200m2 of footprint is available for sale. This elegantly planned property comprises of an entrance hall leading to an occasional sitting area, a formal sitting area interconnecting with the open plan (kitchen / dining) all over looking the pool deck area ideal for entertainment. Property also enjoys an office, 3 double bedrooms (all with en-suite), a laundry room, a self sufficient flat-let & a 7 car garage with 2 entrances. This freehold property is being sold highly finished, has a private well & own airspace. Viewing is a must!", "details": {"Size": "1200sqm", "Bathrooms": "3"}, "features": ["Ample space for entertaining", "Close to all amenities", "Elevated position", "Good return on investment", "High end property", "Highly finished", "Naturally lit", "Prestigious location", "Sought after area", "Stunning views", "Unique and elegant abode"]}
{"id": "313789", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Birguma", "price": "€926,000", "description": "A great opportunity to live in a semi-detached BUNGALOW. Being sold in shell form, set on a plot of 458 sqm and located within a bungalow build zone, this property comprises a nice bright open plan kitchen, living and dining area overlooking the surrounding 148 sqm of garden and pool area, three bedrooms (main with en suite), main bathroom, semi-basement garage for at least 3 cars and access for a washroom on roof.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Swimming Pool", "Garden", "Views", "Shops"]}
{"id": "Bung15098", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mellieha", "price": "€2,500,000", "description": "A unique fully detached bungalow on over 1500sqm, enjoying distant unobstructed views. Property is built on 4 levels enjoying open plan spacious living areas including gym, pool, games room, cinema room and much much more. Nothing like it on the market!", "details": {"Bathrooms": "6"}, "features": ["Sitting", "Dining", "Living", "Kitchen", "Laundry", "Garden", "Basement", "Pool", "Study", "Roof", "Sea views", "Wine cellar", "Terrace", "Flatlet", "Country views", "Car capacity"]}
{"id": "W-01D6FS", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Dingli", "price": "€4,660,000", "description": "This lovely property has recently been put up for sale in Malta. This luxurious estate has unique and spectacular sea and country views, surrounding these 2 detached bungalows. In total, this estate has over 29 Tumoli of land with its own private driveway and gardens. In one of the bungalows, the layout comprises: Large Kitchen/Dining area Living Area 2 Double Bedrooms Main Bathroom 2 Car Garage The Second Bungalow features: Kitchen/Dining/Living area 2 Double Bedrooms Main Bathroom Complimenting this lovely property is a rather large water reservoir. This property is ideal for someone who would like to have their own paradise in the Mediterranean Sea. For more information, please call the number provided above or contact one of our exclusive property lounges situated across the island of Malta.", "details": {"Size": "81sqm", "Bathrooms": "3"}, "features": ["Garage", "Tiles", "Fireplace", "Terrace", "Alarm system", "Accessible for wheelchairs", "Swimming pool", "AC", "Garden", "Sea/lake view", "Built-in Kitchen"]}
{"id": "000118", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Mellieha", "price": "€1,795,000", "description": "This is a luxurious and expansive bungalow located in Santa Marija Estate in Mellieha built on a plot of 1,300 sq. m. and offering views of the bay and the open sea. Access to the property is through the drive-in which takes you to the graciously curved staircase to the house as well as to the 2-car garage on the lower level. This furnished property comprises a sizeable central courtyard, 6 bedrooms (5 of which with ensuite bathroom), lounge, very spacious living room and dining room, kitchen, library and study and a large patio. There is also an underlying one-bedroomed flatlet. It has a well-established garden and a sizeable swimming pool with spacious sundeck", "details": {}, "features": []}
{"id": "W-01DLIG", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€2,800,000", "description": "A Luxurious home in Malta! This lovely gorgeous bungalow is situated in a peaceful area, having an attractive set up of accommodation. The property is surrounded by nature and enjoys total privacy. This property comes in the form of: A kitchen/breakfast room A Living Room A Dining Room Four Bedrooms Large out door area ideal for entertaining your guests Swimming pool area A drive way that can hold up to 4 to 5 cars This property is certainly worth viewing. A beautiful property in Malta. For more information on this lovely bungalow do not hesitate to contact the number provided.", "details": {"Size": "400sqm", "Bathrooms": "3"}, "features": ["Garage", "Central Heating", "Wooden floor", "Parquet", "Tiles", "Swimming pool", "AC", "Garden", "Built-in Kitchen"]}
{"id": "912278", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Wardija", "price": "€3,100,000", "description": "A jewel of a property - Unique country residence covering approximately 13,000 square meters situated on high grounds and enjoying extensive views. This property, a detached BUNGALOW is being transformed into a four bedroom residence with a large deck, pool area and surrounded gardens. A dream to many and a reality for only one. Highly recommended.", "details": {}, "features": ["Swimming Pool", "Back Yard", "Views", "Shops"]}
{"id": "000252", "type": "bungalow", "title": "7 Bedroom Bungalow For Sale in Madliena", "price": "€7,000,000", "description": "Built on the highest part of Madliena and enjoying uninterrupted open sea and country views. The villa is being sold in shell, currently under construction and is set on approximately 2,317 sqm of land. Accommodation comprises of a large welcoming hall, kitchen/dining, a pantry, guest toilet, sitting room, living room, office and a bedroom with its independent en suite shower room (which is ideal for a nanny or housekeeper), a nice large swimming pool, deck area and large garden with ample space to entertain. On the top floor one finds 6 bedrooms (all with en suite showers) study, guest toilet and guest apartment. Complimenting this Luxury property is an indoor pool, squash court, gym, sauna, games room and 2 bathrooms which are located in the basement with a passenger lift that serves all levels and car port. A very rare find and highly recommended!", "details": {"Bathrooms": "7"}, "features": []}
{"id": "W-028W4P", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Zabbar", "price": "€690,000", "description": "Set on approximately 1400sqm of land and situated on the outskirts of Żabbar to Xghajra is the old farm having permits for a fully detached 4 bedroom Bungalow. Layout comprises of; An entrance hall Kitchen / Dining area Four Bedrooms all served with an en-suite Guest Bathroom Washroom Roof Terrace This property is freehold and has ample of outdoor space where one can entertain.For more information send me a message or call me on the number below.", "details": {"Size": "197sqm", "Bathrooms": "4"}, "features": ["Garden", "Sea/lake view"]}
{"id": "506868", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Mellieha", "price": "€1,650,000", "description": "Fully detached cul-de-sac BUNGALOW set on 1,110 sqm of land located in a sought after tranquil area of Mellieha yet close to all amenities and with beautiful sea views. Accommodation comprising an L-shaped sitting, living and dining area, separate kitchen, 2 double bedrooms with an option for a third, en-suite bathroom, main bathroom, guest toilet and third room which can be used as a conservatory/games room and side terrace. Property also boasts of a drive-way that can take up to 10 cars and is fully surrounded with approximately a tumulo of mature garden and 2-car garage/basement. Freehold PROPERTY IS ALSO TO-LET.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Garden", "Balconies", "Views", "Airconditioning", "Shops"]}
{"id": "314259", "type": "bungalow", "title": "2 Bedroom Bungalow For Sale in Burmarrad", "price": "€1,000,000", "description": "Stunning BUNGALOW located in a beautiful rural area with unobstructed country views. Property consists of two bedrooms, main bathroom, bright and spacious kitchen/living/dining room, outdoor deck area, gazebo with BBQ area, large landscaped area and private drive. Freehold PROPERTY IS ALSO TO-LET. Items Included in Price Brand new finished kitchen and bathrooms.", "details": {"Bathrooms": "1"}, "features": ["Swimming Pool", "Garden", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "912322", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mosta", "price": "€2,780,000", "description": "Fully DETACHED BUNGALOW having a classical design and built on a large garden measuring approximately 3,500 sqm. Situated in San Pawl tat Targa in a cul de sac and enjoying excellent open views of the countryside and sea in the distance, the property is set within a mature garden with a private pool and fish ponds and is accessed through a long driveway. The main accommodation comprises a large sitting room, dining room, kitchen and 3 double bedrooms. There is a second kitchen downstairs near the pool, 2 living rooms, 3 bathrooms and a shower room. A four car garage underlies the property. An excellent family home and a rare find given the size of the garden. Freehold Items Included in Price Bore hole in garden, fire place in kitchen, fully fitted kitchen, marble floors.", "details": {"Bathrooms": "3"}, "features": ["Garage", "Swimming Pool", "Garden", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "SBNG41200", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bidnija", "price": "€1,000,000", "description": "Regretfully for sale fully detached bungalow spread over 3/4 tumoli of land and set on higher grounds enjoying guaranteed unobstructed country views. Accommodation comes in the form of a spacious bright living room overlooking a front garden and a large fitted solid pine kitchen with appliances, also overlooking the front garden. A split level leads to the sleeping quarters comprising of three well-lit double bedrooms, master with a large en suite, and a large family bathroom. This lovely property is built on a squarish plot (no deformities), boasting of a large garden with possibility for a pool, sauna converted shed and a one car street level garage. Offered freehold and unfurnished.", "details": {"Bathrooms": "2"}, "features": ["Unfurnished", "Finished", "Entertainment Room", "Garage", "Garden", "Outdoor Area", "BBQ Area", "Country View", "Fireplace", "Finished Form"]}
{"id": "W-01CUPW", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Sliema", "price": "€670,000", "description": "Double fronted Terraced Bungalow situated in a central area. Accommodation comprises of: Entrance hall Sitting room Dining room Kitchen / breakfast Living room 3 bedrooms Bathroom Shower room A good sized front garden Backyard An interconnecting one car garage leading to another room For more information about this property, contact the number provided or visit one of our lounges located around Malta.", "details": {"Size": "140sqm", "Bathrooms": "3"}, "features": ["Garage", "Tiles", "Fireplace", "Garden"]}
{"id": "701139", "type": "bungalow", "title": "4 Bedroom Detached Bungalow For Sale in Mellieha", "price": "€9,500,000", "description": "Fully detached BUNGALOW luxuriously finished and furnished, built on 1.9 tumoli of land with unobstructed sea and country views. Entrance into a large square hallway leading to a very large open plan fully equipped kitchen, dining and living area, enjoying 180 degree sea and country views extending as far as Gozo. On the other side of the open hallway one finds three large double bedrooms (main with en-suite shower room) and a separate bathroom. The property also includes an underlying flat let, spare bathroom, large kitchen, sitting and dining area with living area and pool table. Outside one finds a beautiful kidney-shaped swimming pool with Jacuzzi, log oven and shower room. Must be seen to be appreciated. Freehold PROPERTY IS ALSO TO-LET. Items Included in Price Lift, wine cellar, fire place, jacuzzi and reservoir.", "details": {"Bathrooms": "2"}, "features": ["Washroom", "Garage", "Swimming Pool", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "W-028FL0", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,300,000", "description": "Very spacious fully detached Bungalow for sale in Mellieha. This property for sale in Malta is situated in one of the best streets of Santa Maria Estate and enjoys beautiful unobstructed sea views. This property has many features which include: Large Living / Dining Fully fledged Kitchen 3 double bedrooms 2 walk in wardrobes en-suite 3 other bathrooms Large Pool and deck area with sea views 8 car garage gym wash room study The Bungalow is built on a plot measuring 1100sqm . For more information on this property contact the number provided above or call one of our lounges located around Malta.", "details": {"Size": "255sqm", "Bathrooms": "4"}, "features": ["Garage", "Tiles", "Swimming pool", "Sea/lake view"]}
{"id": "W-028FRT", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€900,000", "description": "Built on rocks and set on high grounds is this fully detached Bungalow for sale in Mellieha. This property for sale in Malta enjoys beautiful green and sea views and has been built over 1000sqm. This property has many features which include: Welcoming hall Sitting/living dining kitchen/breakfast 3 double bedrooms 2 bathrooms large basement including a flat let 3 car garage water reservoir back garden For more information on this property contact the number provided above or call one of our lounges located around Malta.", "details": {"Size": "300sqm", "Bathrooms": "3"}, "features": ["Garage", "Basement", "Sea/lake view"]}
{"id": "007AT08358", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Mellieha", "price": "€1,750,000", "description": "Beautiful bungalow located in Santa Marija Estate in Mellieha built on a plot of 1,300 sq. m. offering lovely views of the bay and the open sea. Access to the property is through the drive-in which takes you to the graciously curved staircase to the house as well as to the 2-car garage on the lower level. This well finished property comprises a sizeable central courtyard, 6 bedrooms (5 of which with en-suite bathroom), lounge, spacious living room and dining room, kitchen, library, study and a large patio. There is also an underlying one-bedroom flat-let. It has a well-established garden and a sizeable swimming pool with spacious sundeck.", "details": {"Bathrooms": "5"}, "features": ["Garage", "Swimming Pool", "Views"]}
{"id": "W-01CLH8", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,330,000", "description": "Fully detached BUNGALOW for sale in Malta, situated on high grounds in a cul de sac and enjoying open sea views from it's front terrace. Accommodation consists of 18 rooms and comes in the form of: entrance hall separate sitting room with functional fire place formal dining room fully fitted living/kitchen/dining room three double bedrooms and two terraces. Complimenting this property is an underlying self contained flat let which could be split in two, one car garage which can be easily extended, driveway that can accommodate 5 cars and two separate gardens with mature fruit trees plus space for a swimming pool. Call us today to book your viewing!", "details": {"Size": "700sqm", "Bathrooms": "4"}, "features": ["Garage", "Fireplace", "Sea/lake view", "Built-in Kitchen"]}
{"id": "000210", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,745,000", "description": "Fully modern and well kept detached VILLA is set on 1,5 tumoli of land The property is built on solid rock and has full sea view from its extensive terraces. Spacious accommodation in the form of a large combined lounge, dining area ( ca 40 m2 ) with an working open fire place, a modern pellet heater. A large modern fitted kitchen and breakfast bar/area.. 3 double bedrooms - master with en-suite shower, 2 luxury bathrooms. Every bedroom is equipped with an A/C annex heater. Property also boasts of a surrounding mature garden with sea view terraces, large terrace around the whole property and a very large ( 9 x 5 meter ) and private swimming pool surrounded by an extensive deck area ideal for entertaining. A large 4-car garage, with a workshop area and another room ( 6x3 meter ), which can be converted to a flat let or be used as a hobby room. Multiple options for this area. Under the 4 car garage is a reservoir for fresh water. This reservoir is connected by an ingenious pump system to the water filtration system, which provides clear drink water in the whole villa.", "details": {"Bathrooms": "3"}, "features": []}
{"id": "W-01DKFT", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,750,000", "description": "Malta luxury Real estate. At E&V Sara Grech we have your property needs covered. This luxurious and expansive bungalow is located in Santa Marija Estate in Mellieha. This beautiful property was built on a plot of 1,300sq.m and offers views of the famous Mellieha Bay and the Mediterranean Sea. You can access the property through a private drive through. The property comes in form of: A sizeable central courtyard Six Bedrooms (Five of which have an en-suite) A Lounge A very spacious living/dining room A study A large patio This property comes with a luxurious swimming pool and a spacious sundeck. To add this beautiful property to your Mediterranean real estate portfolio please call the number provided.", "details": {"Bathrooms": "4"}, "features": ["Garage", "Tiles", "Swimming pool", "Basement"]}
{"id": "SBNG40328", "type": "bungalow", "title": "2 Bedroom Bungalow For Sale in Attard", "price": "€409,000", "description": "Bungalow in Attard consisting of a front garden/yard, kitchen/living area, separate dining, two double bedrooms, two bathrooms and a back yard. This small bungalow can easily be turned into a three bedroom with enough space for a street level garage.", "details": {"Size": "100sqm", "Bathrooms": "2"}, "features": ["Ordinary Finished", "Finished", "Outdoor Area", "Internal Yard", "Finished Form", "Own Roof"]}
{"id": "VLA4145", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Ta' l-Ibragg", "price": "€1,800,000", "description": "TA L-IBRAGG € 1,800,000. Set on 1 tumolo of land, this luxury elevated BUNGALOW is located in a desirable and tranquil location. Newly renovated and modernly furnished to high specifications, this bungalow is truly one of a kind. Accommodation comprises of a large open plan fully equipped fitted kitchen/dining/living room, pantry, guest toilet, 3 bedrooms (all with en-suite), master bedroom enjoys a walk-in wardrobe, full roof, wash room. Large swimming pool with a massive deck area and shower facilities, a mature surrounding garden, largegarage and drive-in. Further details on request. Also available for sale.", "details": {"Size": "1100sqm"}, "features": ["Swimming Pool", "Garden"]}
{"id": "Bung14755", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bidnija", "price": "€2,500,000", "description": "Rare to come by! A fully detached bungalow on 7000sqm. Bungalow will be built on a footprint of 200sqm enjoying 3 large double bedrooms ensuite and a lovely and spacious open plan kitchen living dining onto pool. A dream home! Recommended.", "details": {"Bathrooms": "3"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Roof", "Fireplace", "Wine cellar", "Terrace", "Utility/boxroom", "Car capacity", "Balcony"]}
{"id": "240201006-347", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Buskett", "price": "€870,000", "description": "Buskett - Fully Detached, 3 bedroom Bungalow in a rural area of Buskett, measuring 342sqm. Still on plan. To be sold in shell-Form. Freehold.", "details": {"Size": "342sqm"}, "features": ["Country Side", "Country Views", "Open Views", "Outskirts"]}
{"id": "311993", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Mosta", "price": "€3,500,000", "description": "An impressive and designer-finished fully DETACHED BUNGALOW built over an area of 3,500 sqm. Elevated layout consists of formal sitting/dining area, kitchen/living room - both leading onto a terrace overlooking the garden and pool, 3 double bedrooms (main with en suite), main bathroom and storage room. The beautiful landscaped gardens, pool area (both approx. 1,500 sqm) and green house further complement the property. On ground floor level, one finds an interconnecting 1 bedroom flat-let with separate entrance, billiard room, gym, washroom, storage room and 2 interconnecting 4-car garages. Extras include air-conditioning, granite flooring, fireplaces and security & satellite systems. Freehold. PROPERTY IS ALSO TO-LET.", "details": {"Bathrooms": "3"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "17102", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€7,000,000", "description": "A Detached Bungalow, set on approximately 2,317sqm of land, currently under construction and to be built in shell form state by end 2017., situated in a highly sought after location, commanding unobstructed distant sea-views. Spacious accommodation comprises of an entrance hall, kitchen/dining, a pantry, guest toilet, sitting room, living room, bathroom, office, a bedroom with own shower en-suite (ideal for guests/nanny/house-helper), a large swimming pool with ample deck area, lawn and garden. Upstairs, one finds 6 bedrooms (all of which come with shower en-suite facilities) a study, guest toilet and guest apartment. This unique property further comprises an indoor-pool, squash court, gym, sauna, games room and 2 bathrooms (all of which are situated at basement level), a private car port, a large garage and an internal passenger lift servicing all floors.", "details": {"Size": "2200sqm"}, "features": ["Swimming Pool", "Sea View", "Valley View", "Terrace", "Balcony", "Yard", "Lift", "Garage", "Parking Space", "Roof Terrace", "Ground Floor", "Shell Form", "Open Plan", "Airspace", "Detached", "Whole Roof"]}
{"id": "240071057-560", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€3,250,000", "description": "The word' Luxury' comes to mind the minute you get to the gates of this sea front bungalow located in the Southern part of the island. Property is built on a tumolo of land (circa 1,283 square metres) and enjoys a 100 foot fa ade overlooking the opposite sea shore and the open sea. Property has been finished with extensive use of marble and high quality materials. Layout consists of an entrance hall, large bright living space and kitchen / dining area, three/four bedrooms (three of which with en suite), guest rest room, a laundry room and massive basement consisting of an eight car garage, gym and other utility rooms. This property comes with large indoor pool and outdoor pool surrounded by a large deck area. Property is fully detached and viewing comes highly recommended.", "details": {"Size": "1283sqm", "Bathrooms": "3"}, "features": ["Garden", "Swimming Pool", "Luxury Finish", "En Suite", "Near Bus", "Sea Front", "Sea View", "5+ Car Garage"]}
{"id": "17044", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,200,000", "description": "MELLIEHA - A very spacious bungalow located in one of Malta's elite residential areas offering ample entertainment space and is finished. On entrance one finds a large welcoming hall followed by a formal lounge/dining area. Fitted solid kitchen/living/dining room leading to a spacious terrace which keeps surrounding the property also enjoying open views. Following are three double bedrooms. Main bedroom with an en-suite and a walk-in closet. A main bathroom and a washroom and an office. Large games room and a gym. A entertainment area around a large swimming pool with a jacuzzi and a lovely deck area enjoying amazing views, The views from the large mature garden extend as far as Gozo. An 8 car garage and a flatlet compliments this property. A very rare find at a bargain price", "details": {"Size": "1100sqm"}, "features": ["Swimming Pool", "Sea View", "Valley View", "Terrace", "Balcony", "Furnished", "Air Conditioning", "Jacuzzi", "Garden", "Open Plan", "Airspace", "Detached", "Ground Rent", "Finished", "Pet Friendly"]}
{"id": "314837", "type": "bungalow", "title": "4 Bedroom Detached Bungalow For Sale in Iklin", "price": "€2,700,000", "description": "Unique, fully detached VILLA situated in an up market and sought after villa area, on high grounds in Iklin. Property consists of a lovely reception and hall area with an imposing marble staircase, open plan living and dining area, formal sitting room and dining room, kitchen/breakfast room, four double bedrooms, wide front terrace, two offices and other extra rooms at basement level. Complementing this property is a 6/8-car garage, large pool and deck area enjoying stunning distant country and town views. Ideal as an ambassador's residence as it allows ample space for entertaining. PROPERTY IS ALSO TO-LET.", "details": {"Bathrooms": "3"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "SFDB40643", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Iklin", "price": "€2,350,000", "description": "Located in the tranquil and sought after villa area of Iklin is this fully detached Bungalow with spectacular views. Layout comprises of a welcoming hall, reception, kitchen with breakfast area, living/dining room, formal sitting and dining room, two guest toilets, four bedrooms, three of which enjoy en suite facilities, main bathroom, two studies, a games room, an eight car driveway leading to a six car lock-up garage and a basement. Each room enjoys spectacular country views and overlooks the pool/deck area. Property features include a fully equipped kitchen, fully air-conditioned, potez heating and photo voltaic panels. One of kind!", "details": {"Bathrooms": "6"}, "features": ["Luxuriously Finished", "Balcony", "Garage", "Garden", "Outdoor Area", "BBQ Area", "Country View"]}
{"id": "240041031-44", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Mellieha", "price": "€1,300,000", "description": "MELLIEHA – New on the market! Fully detached bungalow built on 1,100sqm land, located in the elite, residential area of Santa Maria Estate, minutes’ walk away from the shore. Property comprises a welcoming hall leading to an attractive lounge/dining, and a fitted kitchen/breakfast area, that looks upon the pool terrace. Property further accommodates the main bedroom with an en-suite, a double bedroom with a walk-in wardrobe (currently used as a study), a third bedroom and a bathroom. This home boasts plenty of entertainment space: a large swimming pool with Jacuzzi and pool deck area, together with a garden, all enjoying fantastic views up to Gozo; a games room and a gym, that could be easily converted into a flatlet, an eight-car garage, and a large car port. Property has great potential, is competitively priced and is definitely worth viewing!", "details": {"Size": "400sqm", "Bathrooms": "2"}, "features": ["Built on 1100sqm", "deck area", "Eight car garage", "Elite", "Fantastic views up to Gozo", "Fitted kitchen/breakfast", "Fully Detached", "Games room and gym", "Garden", "Large car port", "Large pool with Jacuzzi", "Minutes' walk from the shore", "residential area", "Three bedrooms"]}
{"id": "JST20857", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bidnija", "price": "€2,500,000", "description": "BIDNIJA – A rare opportunity to acquire a plot of land measuring 8000sqm. Located in an exclusive area, on high grounds, enjoying open and unobstructed country views from all the rooms and leisure area. Permits are issued for a fully detached 3 bedrooms bungalow with large swimming pool. For more info contact our agent today.", "details": {"Bathrooms": "2"}, "features": ["Unconverted", "Country Views", "Quiet Road", "Valley views"]}
{"id": "240171006-963", "type": "bungalow", "title": " Detached Bungalow For Sale in The Village", "price": "€1,490,000", "description": "THE VILLAGE – A grand, Fully Detached Villa, set on approximately 560sqm of land, situated in an excellent, residential location, approximately 500m away from Spinola Bay, St Julians. Spacious accommodation comprises an entrance hall, dining room, sitting room, a study, guest toilet, a conservatory, a living room, fitted kitchen/breakfast, bathroom, three double bedrooms (main with dressing room and shower en-suite), a utility room and a laundry room at roof level. This attractive residence further comprises a large, mature garden, having preparation for a swimming pool and a two/three car garage at ground floor level. Must be seen to be appreciated.", "details": {"Size": "560sqm"}, "features": []}
{"id": "Bung14747", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Mellieha", "price": "€1,300,000", "description": "An older type bungalow full of natural light and sizable rooms, located in one of the best areas of Santa Maria Estate enjoying priceless outstanding open sea and country views. Comprises open plan kitchen / breakfast, living / dining leading out onto a large BBQ terrace, deck area and pool. 4 double bedrooms (main ensuite), main bathroom, guest bathroom, games room, gym, study, washroom and also a 6/8 car street level lock-up garage. Truly an outstanding property. Not to be missed!", "details": {"Bathrooms": "3"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Roof", "Sea views", "Terrace", "Flatlet", "Country views", "Utility/boxroom", "Balcony"]}
{"id": "240121010-923", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Santa Maria Estate (Mellieha)", "price": "Price on Request", "description": "SANTA MARIA ESTATE-A magnificent bungalow offered in shell form enjoying sea views. This tranquil resort=style hideaway is ideal for anyone after true luxury living guranteed complete comfort and privacy. This wonderful property accomodates three bedroom all with en-suite and master bedroom with walk in wardrobe, a large open plan living /kitche/dining. Lower level has a seperate gym and games room, very large 90sqm pool and adjacent a kitchen/living/dining. All levels enjoy sea views. The property has a three car garage and a surrounding garden. It is built on a tumolo of land 1124sqm.", "details": {"Size": "1124sqm", "Bathrooms": "5"}, "features": ["Swimming Pool", "Shell Form", "Entrance Hall", "Sea View", "Interconnected Garage"]}
{"id": "4359688", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Birzebbuga", "price": "€2,000,000", "description": "Bungalow - Birzebbugia A Unique and fully detached bungalow, fully furnished, built on approximately 2 tumoli of land, enjoying total privacy. Comprising of an imposing entrance hall, 2 lounge rooms, dining room, kitchen/breakfast, pantry, 3 bedrooms, 2 bathrooms, spare toilet, study, 2 laundry rooms, 4 car garage, garden and orange grove. There is also a fully furnished flatlet having 4 rooms at the rear of the back yard which is ideal for offices, stores or staff accommodation.", "details": {"Bathrooms": "2"}, "features": []}
{"id": "240041038-6", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Mellieha", "price": "€1,800,000", "description": "MELLIEHA – A very spacious Bungalow, located in one of Malta’s elite, residential areas, offering ample entertainment, space, and finished to high quality standards, having marble floors throughout. On entering, one finds a large welcoming hall, followed by a formal lounge/dining area, fitted, solid kitchen/living/dining room, leading to a spacious, surrounding terrace, which enjoys open views. Further accommodation includes three double bedrooms, (main bedroom having an en-suite and a walk-in closet), a main bathroom and a washroom, two storage rooms and an office, games room and a gym. A summer entertainment area is found downstairs, which includes a swimming pool, with a lovely deck area, enjoying amazing views, a five-car+ garage, and a flat let. A very rare find in St. Maria Estate!", "details": {"Bathrooms": "3"}, "features": []}
{"id": "16870", "type": "bungalow", "title": " Bungalow For Sale in Zabbar", "price": "€940,000", "description": "In the heart of Zabbar is this Bungalow built on an area 2000 sqm surrounded by ODZ countryside. The Property can be developed into a 2 floor + Semibesament Villa or potential for Commercial premises Category 1 permit conditions. Freehold", "details": {}, "features": ["Airspace", "Freehold"]}
{"id": "240121071-109", "type": "bungalow", "title": " Bungalow For Sale in Ta' l-Ibragg", "price": "€1,650,000", "description": "VICTORIA GARDENS – Large and spacious, Detached Bungalow, located in a quiet area. Property welcomes you into a bright hall, with a sitting room, a dining room, and a separate kitchen, all of which overlook the pool and back garden area. There are four double bedrooms, all with en-suites, enjoying side and front garden views. The main and another bedroom share a large balcony overlooking the front garden. Upstairs one would find a large washroom, with lovely sea views. At ground level, there are three, separate, one-large-car lock-up garages, inter-connecting to a flatlet, currently being used as a cinema area.", "details": {"Size": "1124sqm"}, "features": []}
{"id": "240071060-359", "type": "bungalow", "title": "4 Bedroom Detached Bungalow For Sale in Birguma", "price": "€2,950,000", "description": "BIRGUMA – A contemporary, luxurious finished, Detached Bungalow on 1000sqms of land, enjoying views and lots of natural light. No expense has been spared by its owner, a lift connects all floors, all walls and ceilings are insulated, and all the living area and the garage have underfloor heating and cooling. Property also has intelligent lighting throughout and an integrated TV system. An entrance hall leads to a spacious, open plan living/kitchen/dining, and into a sitting/dining area. There are four, large bedrooms, all with an en-suite and walk-in closet, a separate study and a guest toilet. Upstairs one finds a washroom, which can be used as another living room. All rooms are surrounded by a landscaped garden, with a large pool, were one can entertain and enjoy the view. Complementing this property, is a street level, six+ car garage, a games room and a three bedroom flat let.", "details": {"Size": "1005sqm", "Bathrooms": "5"}, "features": []}
{"id": "W-01UIQC", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,450,000", "description": "Newly built fully detached BUNGALOW with basement built on over than 1 tumolo, consisting of : huge kitchen dining / living area pool with sea and valley views up to Gozo 3 double bedrooms all with en suite walk in wardrobe guest toilet pool deck barbecue are 3 car street level garage garden 2 car port Property is being sold in shell form or with the possibility to choose finishing’s standards once still under construction. Please call or visit one of our lounges or our market centre to arrange a viewing.", "details": {"Size": "670sqm", "Bathrooms": "4"}, "features": ["Garage", "Tiles", "Swimming pool", "AC", "Basement", "Garden", "Balcony", "Sea/lake view"]}
{"id": "15521", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mosta", "price": "€780,000", "description": "Sole Agency - A spacious finished Bungalow situated in a very quiet area in Mosta. Accommodation comprises of a welcoming hall leading to a living area, sitting/dining, separate kitchen and a good size outdoor area with space for pool and entertainment area. Furthermore this nice house also includes 3 bedrooms, main with en suite and main bathroom. Complementing this property is a two to three car garage and the possibility to extend further. Freehold", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "240071060-361", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in High Ridge", "price": "€2,900,000", "description": "DETACHED BUNGALOW built on 1260sqm of land, comprising of a wide entrance hall, spacious sitting/dining room combined, kitchen/breakfast complete with appliances overlooking the pool and deck area, 3 double bedrooms, main with an en-suite, guest bathroom, basement with games room, and a 2-car garage. Surrounding the property is a lovely mature garden. Freehold.", "details": {"Size": "1250sqm", "Bathrooms": "2"}, "features": ["First Time Buyer", "Entrance Hall", "2 Car Garage", "Air Conditioning", "Heating"]}
{"id": "213066", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€1,850,000", "description": "A fantastic opportunity to acquire this seafront BUNGALOW with unobstructed views. Property comprises, upon entrance of a large Kitchen, living, dining area, leading to a large pool and entertaining area facing the seafront. Villa has three double bedrooms all with ensuite. Complimenting this properties is a 15 car garage, games room and space for an office. A property not to be missed. Early viewing are highly recommended.", "details": {"Bathrooms": "4"}, "features": ["Washroom", "Garage", "Swimming Pool", "Terrace", "Views", "Shops"]}
{"id": "307259", "type": "bungalow", "title": "5 Bedroom Detached Bungalow For Sale in Dingli", "price": "€4,200,000", "description": "2 FULLY DETACHED BUNGALOWS being sold together situated on high grounds having fantastic panoramic sea and country views and surrounded with 29 tumoli (32596 sqm) of land. The first bungalow consists of a hall, kitchen/breakfast, enormous sitting/dining room, bathroom, 2 double bedrooms and with a total area of 185 sq.m. The second bungalow comprises of a large fitted kitchen/dining room, a commodious and recently renovated reception/living area (37ft x 18ft), three double bedrooms, bathroom, large reservoir and with a total area of 235 sq.m. Freehold.", "details": {"Bathrooms": "2"}, "features": ["Washroom", "Garage", "Swimming Pool", "Views", "Airconditioning", "Shops"]}
{"id": "812321", "type": "bungalow", "title": "5 Bedroom Detached Bungalow For Sale in St Paul's Bay", "price": "€3,000,000", "description": "A distinctive fully Detached BUNGALOW built on a plot of land measuring 1200 sqm and situated on high grounds enjoying fantastic panoramic sea and country views from all rooms and terraces. This spacious accommodation includes a wide entrance hall, large sitting room, dining room, combined kitchen/breakfast/living room, 5 bedrooms, 4 bathrooms (1 of which is en suite), 3 separate shower rooms, laundry room and 2 separate flatlets overlying each other. Each flatlet consists of 2 bedrooms and a large living room. All rooms on the upper floor level are surrounding a large central courtyard. This property is served with a lift which connects all four that include 2 large workshops (each measuring 116 sqm), study room, play room, snooker hall and a large indoor swimming pool. Complementing this property is a 446 sqm terraced garden and a four car lock-up garage. The total internal building area measures 1600 sqm. Items Included in Price Fully fitted teak kitchen and 2 work shops measuring 116 sqm each, 4 car lock up garage.", "details": {"Bathrooms": "4"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Back Yard", "Balconies", "Views", "Shops"]}
{"id": "2111", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€4,750,000", "description": "Fully Detached Bungalow set on 3,000SQM perfectly located on one of the best streets in San Pawl Tat-Targa enjoying spectacular sea and valley views. This Bungalow comprises of a welcoming entrance hallway onto a formal Siting and Dining, Seperate fully equipped kitchen/Breakfast, 3 Double Bedrooms suites, utility room, Full basement with space for Gym/Games room and main bathroom. The outdoor area consists of a large Pool and deck area, Full size Tennis court and is complimented by a private driveway and an interconnected street level 2/3 Car lockup garage.", "details": {"Size": "3000sqm"}, "features": ["Swimming Pool", "Sea View", "Valley View", "Terrace", "Balcony", "Garage", "Furnished", "Garden", "Study", "Utility Room", "Basement", "Airspace", "Detached", "Freehold"]}
{"id": "10568", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mosta", "price": "€950,000", "description": "Fully detached double fronted bungalow set on approx. 650 sqm in the sought after village having welcoming hall, 4 double bedrooms, large living and dining combined, separate formal dining, bathroom and guest toilet, separate fitted kitchen. Includes large basement underneath the whole houes, garage, front and back garden For more information call Andy Stowne 2158 0400", "details": {}, "features": []}
{"id": "16387", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Kappara", "price": "€860,000", "description": "An elevated semi detached bungalow finished to high specifications. This beautiful bungalow forms part of our luxury real estate portfolio and is located in Kappara. The property comprises of: Entrance hall, kitchen living/dining rooms, three bedrooms (one ensuite }guests bathroom and a four car garage  Underlying is a two bedroom flatlet with fitted kitchen, large living area leading to the back garden, which has space for a good sized pool. A perfect family home   Entrance hall Kitchen Living / dining 3 bedrooms of which one has en suite Bathroom 4 car garage  Underlying is a two bedroom flatlet with fitted kitchen, large living area leading to the back garden, which has space for pool. This could be your great Malta home.", "details": {"Size": "365sqm"}, "features": ["Valley View", "Garage", "Air Conditioning", "Garden", "Roof Terrace", "Open Plan", "Basement", "Airspace", "Semi Detached", "Freehold", "Finished", "Pet Friendly"]}
{"id": "309931", "type": "bungalow", "title": "4 Bedroom Detached Bungalow For Sale in Madliena", "price": "Price on Request", "description": "A true rare find - detached VILLA set on high grounds, spread on 4,560 sqm of land with the most amazing views of the island from all its terraces. Presently comprising hallway, kitchen/breakfast area, living area, dining room, reception room, central courtyard, four double bedrooms, two bathrooms, terraces, guest toilet, surrounding garden, swimming pool with entertaining and deck area, games room, tennis court, six car port and six car garage. Also ideal as a site.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Swimming Pool", "Garden", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "106281", "type": "bungalow", "title": "3 Bedroom Terraced Bungalow For Sale in Gozo - Xaghra", "price": "€325,000", "description": "Superb sea and country views are enjoyed from this TERRACED BUNGALOW, built on one floor with plenty of space for extending onto a large beautiful residence with all rooms overlooking the garden, pool and view. Currently consisting of combined kitchen/living and dining, bathroom, 3 bedrooms, side yard/garden, washroom and ownership of roof and airspace. Freehold. Ideal also for developing into nice apartments with views. Excellent property in a unique and most sought after location.", "details": {"Bathrooms": "1"}, "features": ["Swimming Pool", "Garden", "Terrace", "Views", "Shops"]}
{"id": "SBNG39821", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in St Julian's", "price": "€3,500,000", "description": "An immaculate detached bungalow set on a large plot of 1500sqm, in a sought after residential area of Malta. All rooms in this property overlook a beautiful outdoor area surrounded by a very-well maintained mature garden with a fantastic large pool, gazebo, waterfall, cascade, BBQ area, a secluded kitchenette and much more. The ideal environment for outdoor entertaining. Accommodation comprises of an extraordinary hallway overlooking a beautiful reception area mainly classic sitting room ideal for large parties, formal dining room, fitted kitchen, informal dining area, two double bedrooms both with bathrooms and space for 4 other rooms which can be used as other bedrooms and bathrooms, TV area, three other guest shower/toilets and an outdoor kitchen. Pool and garden area also have separate access. This property has many other highlights including air conditioning throughout, an alarm system, double glazing and a water well. There is also potential to build another floor if needed or to create a separate flatlet from the present building.", "details": {"Size": "600sqm", "Bathrooms": "4"}, "features": ["Luxuriously Finished", "Garden", "Outdoor Area"]}
{"id": "13836", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mosta", "price": "€800,000", "description": "A very spacious semi-detached bungalow situated in a nice area in Mosta having a large kitchen/living, sitting/dining, three double bedrooms, main with en suite, main bathroom and a good sized yard with well. Complementing this property is also a very large interconnecting basement which accommodates up to six cars.", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "107551", "type": "bungalow", "title": "2 Bedroom Bungalow For Sale in Gozo - Sannat", "price": "€315,000", "description": "Tucked away at the end of a small alley, this pretty newly built rustic ground floor HOUSE OF CHARACTER is the perfect hideaway. Comprising of an entrance through a gate to the open courtyard leading to an entrance hallway, large wide seating area with kitchen and dining area. Near the sitting area there is a door to the swimming pool, sunbathing area and to the barbecue area. One spacious bedroom with a double bed and with en suite shower room. One bedroom with 2 single beds which got a bathroom facing this bedroom. From the kitchen there is a door leading to a stone spiral staircase which takes you to the large roof terrace enjoying open unobstructed country views.", "details": {"Bathrooms": "1"}, "features": ["Swimming Pool", "Views", "Shops"]}
{"id": "10658", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in St Paul's Bay", "price": "€1,250,000", "description": "Cliff edged Bungalow enjoying distant sea & country views from all terraces. Property has been refurbished to highest standards. Layout comprises of a grand entrance hall,study, large formal sitting/dining room, separate lounge with fireplace, fitted kitchen/breakfast, spacious front & back sun terraces, 4-bedrooms, main & ensuite bathrooms, guest toilet, washroom, gym, sauna, large office/workshop, large storage space and a 5/6 car garage. a real gem !", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "750177", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Marsaxlokk", "price": "€1,150,000", "description": "A rare opportunity to acquire a fully detached BUNGALOW in the most sought after area of Marsaxlokk, built on almost 900sqm of land enjoying also very nice unobstructed country views. This bungalow is impeccably well kept and finished to high standards. Upon entering you will find a large hall of approx. 100sqm which is surrounded by three bedrooms, two bathrooms, dining area, living area, kitchen area followed by another living room overlooking the pool area. Property is complemented by a 60sqm pool and large deck area, entertainment area and separate kitchen and washroom. An additional 2-bedroom flatlet is found at ground level followed by a 9-car garage, front garden and drive-in. Viewings are highly recommended.", "details": {"Bathrooms": "2"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Balconies", "Views", "Airconditioning", "Shops"]}
{"id": "PP00020235", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mosta", "price": "€850,000", "description": "Bungalow built on a 42 X 81 foot plot with underlying 10 car garage. Property comprising a wide entrance hall, a separate living room, a fitted kitchen / dining room, internal yard, 3 double bedrooms, 2 bathrooms, study, a large back yard ideal for entertainment, laundry room and large roof with airspace.", "details": {"Size": "260sqm", "Bathrooms": "2"}, "features": ["Luxuriously Finished", "Yard", "Garden", "Own Roof"]}
{"id": "240071060-359", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Birguma", "price": "€2,950,000", "description": "A contemporary luxurious finished Detached Bungalow on 1000 sqms of land enjoying views and lots of natural light. No expense has been spared by it's owner, a lift connects all floors, all walls and ceilings are insulated, with all the living area and garage have under floor heating and cooling, intelligent lighting throughout and an integrated TV system. Property consists of an entrance leading to a spacious open plan living/kitchen/dining, into a sitting/dining area, 4 large bedrooms all with ensuite and walk-in closet, separate study, guest toilet and upstairs one finds a washroom which can be used as another living. All rooms are surrounded by a landscaped garden and a large pool were one can entertain and enjoys the view. Complimenting this property is a street level 6+ garage, games room and a 3 bedroom flatlet.", "details": {"Size": "1005sqm", "Bathrooms": "5"}, "features": ["Roof (Full)", "Swimming Pool", "New Building", "Walk in Wardrobe", "5+ Car Garage", "Street Level Garage"]}
{"id": "14672", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Attard", "price": "€2,350,000", "description": "A unique residence in this beautiful and tranquil village, rich in history and heritage is a rare opportunity to come across. A fully detached BUNGALOW on 1450sqm  One finds the entrance hallway directly onlooking a most wonderful back garden packed with various fruit trees and a large pool, living room, impressive sitting, separate dining room, kitchen/dining, bathroom and three large bedrooms. An imposing mahogany staircase which leads to the top floor were one finds another bedroom This villa is rich in history with its original columns. Possibility to build another floor.Also included in the price are two garages. Must be seen to be fully appreciated.", "details": {"Size": "1450sqm"}, "features": []}
{"id": "13957", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Bahrija", "price": "€918,000", "description": "Luxuriously finished bungalow in this sought after area of Bahrija. Property comprises of a very spacious entrance hall with a formal sitting and dining room, separate large fully fitted kitchen and dining area, guest toilet/shower, all leading to a beautiful spacious back garden. Furthermore, accommodation includes 4 double bedrooms, main with en suite, main bathroom and a very large terrace. Complementing this nice property is also a 6 car lockup garage and car port with space for another 3 cars.", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "13260", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€1,115,000", "description": "A fully detached seafront bungalow enjoying uninterrupted sea and country views is being offered for sale in advanced shell form. accommodation comprises of a very welcoming entrance hall, with a very large open plan living area, a separate very large kitchen/dining, 3 double bedrooms all with ensuite, guest toilet and study. Complementing this beautiful property is a very nicely laid out pool & jacuzzi, spacious BBQ and deck area, large basement garage accommodating about 10 cars, games room with bar, washroom, changing rooms & showers, service tunnel, storage space.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "3227544", "type": "bungalow", "title": "14 Bedroom Bungalow For Sale in Mdina", "price": "€7,000,000", "description": "Palazzo - Mdina. Rumoured to be the 2nd largest palazzo in Mdina - the \"Silent City\" and the first capital city of Malta, this property is virtually fully detached. There are 33 rooms including a large grand hall (sala nobile) and 4 bathrooms. Most of the rooms on the 1st floor lead onto a spacious terrace surrounded by a roofed passageway and overlooking a large central courtyard. Built in the 1400s with a main grand staircase, spiral staircase & garage. Once modernised, it would make an outstanding boutique hotel.", "details": {"Bathrooms": "4"}, "features": []}
{"id": "W-01UIP4", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,800,000", "description": "Newly built fully detached Bungalow with basement built on over than 1 tumolo, consisting of: Huge kitchen Dining area Living area overlooking a sea horizon infinity pool with guaranteed sea and valley view’s up to Gozo. 3 double bedrooms all with en suite and walk in wardrobe Guest toilet Very big pool deck Barbecue area 3 car street level garage Property is compromised with all round garden and a 2 car port. Property is being sold in shell form or with the possibility to choose finishing’s standards once still under construction. Please call or visit one of our lounges or our market centre to arrange a viewing.", "details": {"Size": "720sqm", "Bathrooms": "4"}, "features": ["Garage", "Tiles", "Swimming pool", "AC", "Basement", "Garden", "Balcony", "Sea/lake view"]}
{"id": "12827", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Madliena", "price": "€5,000,000", "description": "Located on high ground and commanding guaranteed and unparalled panoramic country and seaviews is this fully detached Bungalow set on circa 2,000sqm of land. Access to this unique property is via a driveway. Accommodation comprises a welcoming hall, lounge/dining room, fitted kitchen/breakfast/living area, separate living room, four bedrooms (main with lounge area and en-suite bathroom) and the family bathroom. A separate driveway provides access to a carport and an independent flatlet incorporating a fitted kitchen, lounge/dining area, bedroom (with walk-in closet and en-suite shower). Complimenting this outstanding property is a two car lock-up garage, mature surrounding gardens and a swimming pool and deck area enjoying views of the Mediterranean Sea.", "details": {"Bathrooms": "3"}, "features": ["View", "Garage"]}
{"id": "107116", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Gozo - Xaghra", "price": "€620,000", "description": "BUNGALOW with great potential for additional development is selling partly furnished and consists of three bedrooms, two bathrooms, laundry room, sitting room, kitchen, combined dining/living room, large back terrace with excellent sea and country views and also with space for a pool. This property has a separate entrance for its own air space with the possibility of building another maisonette. Basement also has a separate entrance. A three car garage is also included.", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Terrace", "Views", "Shops"]}
{"id": "W-01COCQ", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Dingli", "price": "€3,495,000", "description": "Fully Detached Bungalow for sale situated in the countryside and located in the quite village of Dingli. Built on approximately 1 tumuli (one third of an acre) and surrounded by 28 tumuli of agricultural land. Accommodation comprising of: Entrance hall Large sitting room Living room Kitchen/dining 3 double bedrooms (main en-suite) Bathroom 8 car garage 20' x 20' swimming pool A fabulous home enjoying fantastic views. For more information please call the number provided above or contact one of our property lounges located across the island of Malta.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Tiles", "Swimming pool", "Garden"]}
{"id": "14865", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Rabat", "price": "€7,500,000", "description": "Set in one of the most beautiful parts of the Maltese countryside this detached BUNGALOW enjoying fantastic views with swimming pool, tennis court a garden measuring nine tumoli (approx 10116 sqm). Accommodation of the main house comprises hall lounge with an open plan kitchen, dining room, three bedrooms, two en suite bathrooms, main bathroom, large terraces, drive way, games room and two bedroom flatlet. Also included is a large warehouse that can house 10 cars as a large garage accessible from a separate drive way at the back of the house. The property also comprises of reservoir of 48,000 gallons and", "details": {"Bathrooms": "3"}, "features": ["View", "Garage"]}
{"id": "315867", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Kirkop", "price": "€750,000", "description": "An impressive 2/3 bedroom BUNGALOW on a total area of 674 sqm. This unconverted house can either be developed or further extended with one floor on top enjoying a 392 sqm garden space plus a back yard. Unique opportunity in a lovely quiet village. Freehold", "details": {"Bathrooms": "1"}, "features": ["Garden", "Shops"]}
{"id": "W-025RL0", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€950,000", "description": "A fully detached three bedroom bungalow situated in Mellieha awarded \"European Destination of Excellence\" This beautiful property for sale in Malta is to be sold in shell form, so the owner can finish the bungalow to their exact requirements. This wonderful property for sale in Malta also boasts a pool and landscaped gardens with massive out door space and excellent views over the prestigious Santa Maria Estate and of the bay beyond. This property for sale in Malta comprises of Spacious kitchen/dining Living area Three double bedrooms all with un-suite Study Guest toilet Wine cellar Games room Gym Two further bathrooms 3/4 Car garage Pool The bungalow has a living area of 284sqm and a plot total of 975sqm, this is truly well thought out bungalow and is complimented with a large roof terrace. Finished by you to the standards you deserve. A true gem in Mellieha. For more information on this property contact the number provided or call one of our lounges located around Malta.", "details": {"Size": "284sqm", "Bathrooms": "6"}, "features": ["No flooring", "Swimming pool", "Basement", "Guest toilet", "Sea/lake view"]}
{"id": "W-021N7E", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Bahrija", "price": "€4,236,000", "description": "Large Bungalow for sale located in a great location of Bahrija built on an area of 9,600m² and enjoying absolute privacy. This Bungalow compromises of: Entrance Hallway Living/Dining Room Kitchen/Breakfast Room 3 Double Bedrooms Main Bathroom This property is set on a great location and has wonderful green/sea views. For more information on this beautiful property, please call the number provided above or contact one of our exclusive property lounges situated across the island of Malta.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Tiles", "Garden", "Sea/lake view", "Built-in Kitchen"]}
{"id": "W-0268TK", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Rabat", "price": "€1,499,000", "description": "Set on 1400sqm plot this truly wonderful property is situated in the green and rural area of Landrijiet. This beautiful property for sale in Malta has stunning views of the rambling farmland all around and is a perfect hideaway from the city life, yet only a short drive to Rabat and the ancient city of Mdina and all that they both have to offer. This property for sale in Malta has many features including Large welcoming entrance lobby 3 double bedrooms one with balcony Main bedroom with with en-suite Living area with balcony Kitchen Dining Room Study that could be a fourth bedroom Bathroom with sunken bath Swimming pool Solar heating panels Underlying the bungalow is a studio flat and a large function area with kitchen perfect for entertaining guests. The property also boasts large garages and storage rooms, that now have permits to be demolished and one can build a three bedroom bungalow with surrounding garden. For more information on this property contact number provided or call one of out lounges located around Malta.", "details": {"Size": "550sqm", "Bathrooms": "3"}, "features": ["Cook Top", "Tiles", "Fireplace", "Swimming pool", "Balcony", "Built-in Kitchen", "Cook Top"]}
{"id": "709043", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Mellieha", "price": "€1,900,000", "description": "Magnificently refurbished FULLY DETACHED BUNGALOW with fantastic views set in the tranquil area of Santa Maria Estate. Layout consists of 2/3 bedrooms overlooking the large gardens, study room, combined kitchen/living/dining area with fitted kitchen, main bathroom and shower en-suite to the main bedroom. The large back gardens lead onto the large pool and deck area making this an exceptional place to entertain outdoors. Furthermore it's complemented with a 1 car garage and a 1 car drive in, separate store room, and a one bedroom flat let with shower and living room. Air-condition units, built in wardrobes, and fireplace all complement this property. 1250 sqm plot size having an internal area of 200 sqm. Definitely a must see.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Swimming Pool", "Garden", "Terrace", "Views", "Shops"]}
{"id": "410318", "type": "bungalow", "title": "4 Bedroom Terraced Bungalow For Sale in Ghaxaq", "price": "€520,000", "description": "Situated in a very quiet area on the outskirts of the village comes this wide fronted TERRACED BUNGALOW. Property consists of a large 14 car basement garage with car port. Garage has a stairs leading onto this missive kitchen/living and dining room, hall of 35ft x 16ft being extremely well lit having a sky light and large back yard. Property enjoys also a front garden, four double bedrooms of which main has an ensuite. Also having a spacious family bathroom, washroom on roof level with beautiful obstructive country views.. This property is being sold finished and furnished and is ideal for a large family. Priced to sell. Items Included in Price Kitchen including appliances, 2 double bedrooms, 2 settee, curtains, doors (Construct Furniture).", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Back Yard", "Views", "Airconditioning", "Shops"]}
{"id": "240141016-157", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Bahar Ic-Caghaq", "price": "€3,100,000", "description": "A very well kept detached bungalow, set on approximately 1350sqm, situated in one of the most elite locations. Spacious accommodation is in the form of a large entrance hall, lounge, dining room, fitted kitchen/breakfast/living, three bedrooms and two bathrooms (one of which is en suite). This attractive residence further comprises a mature garden, a swimming pool with ample deck area, a games room, a kitchenette and a four car drive-in leading to a four car garage.", "details": {"Size": "1350sqm", "Bathrooms": "2"}, "features": ["4 car garage", "Garden", "Swimming Pool"]}
{"id": "15122", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Iklin", "price": "€1,800,000", "description": "Bungalow in Iklin with 4965 sqm of Land , 8 cars drive in , and 6 car garage , 4 bedrooms, 2 bathrooms, kitchen , living, sitting, dining room yard with plenty of space for pool. Included also with this gem is an underlying basement. Will be Sold Soon", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "W-025XOB", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€3,250,000", "description": "A gem so close to our sparkling Mediterranean sea you can see your reflection! This stylish seafront Bungalow for sale addresses all your dreams of quality and detail that you have endlessly sought after in your home, in addition endless perfect sunrises and sunsets by the pool in ultimate style and luxury. Upon entering the welcome hall is spacious and bright which leads onto a designer kitchen fitted with all the latest appliances and a classy dining and living area. Complementing the living area you’ll find three/four double bedrooms all of which have en-suite bathrooms, and are all facing the sea with direct access to the pool deck. The master suite includes a jacuzzi with views of the sea. The guest quarters and laundry room are additional to this living area of the bungalow. Access to the basement is from within the home which leads onto an indoor pool which is heated with the latest technology and a number of other large rooms which can be used as an entertainment area or further guest quarters as well as an 6 car garage. Property is also fitted with 14 solar panels in order to be more environmentally friendly. This astounding Bungalow's features include: Huge open Kitchen/Living/Dining area Outdoor pool with large deck area 3/4 Double Bedrooms with Sea Views 3 en-suite Bathrooms Jacuzzi tub in Master Bedroom Guest Bathroom Laundry room Very large basement Heated Indoor pool Interconnected 6 car garage. 14 Solar Panels An absolute must-see! Contact us today using the number provided or visit one of our lounges located around Malta.", "details": {"Bathrooms": "4"}, "features": ["Garage", "Tiles", "Fireplace", "Alarm system", "jacuzzi", "Swimming pool", "AC", "Basement", "Gym", "Guest toilet", "Sea/lake view", "Built-in Kitchen"]}
{"id": "PP00018672", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€2,800,000", "description": "Luxurious corner, fully-detached Bungalow designed to the highest specifications with particular attention given to details and no expenses spared on quality materials. Accommodation enjoys country views, a modern living area, kitchen/dining/sitting, four bedrooms, four bathrooms, a large decking area with pool, an indoor pool, an indoor pool, flat let, garage and a drive-in.", "details": {"Size": "900sqm", "Bathrooms": "4"}, "features": ["Luxuriously Finished", "Yard", "Garden", "Own Roof", "Internet"]}
{"id": "240041016-514", "type": "bungalow", "title": "4 Bedroom Detached Bungalow For Sale in Mellieha", "price": "€1,750,000", "description": "We are proud to offer this outstanding detached bungalow set in an exclusive area of Mellieha. This unique property enjoys sea and country views surrounded by a peaceful neighborhood. Entering the house one will find a large pool and a deck area with ample space enjoying the open view. Layout comprises of a separate kitchen and a combined sitting/dining room leading to a terrace. Four sizeable bedrooms, having an en-suite and a walk-in wardrobe in the main bedroom and a main bathroom. Complimenting this property is an interconnecting flat let with two bedrooms having access to the outdoor area. Viewing is a must. Sole Agency.", "details": {"Size": "2103sqm", "Bathrooms": "2"}, "features": ["Air Space", "sea view", "swimmming pool", "Terrace", "Walk in wardrobe"]}
{"id": "PP00019556", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€950,000", "description": "Detached Bungalow built on a plot of 950sqm. Layout comprises of entrance hall, kitchen/dining, sitting area leading to a pool area, three double bedrooms all with en-suite (main bedroom also having a walk-in) and a study area. At semi-basement level one finds a four car garage, games rooms, gym room and a utility room. Being sold in shell form.", "details": {"Size": "284sqm", "Bathrooms": "3"}, "features": ["Shell", "Garden", "Own Roof"]}
{"id": "15809", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€2,000,000", "description": "One of a kind, Fully Detached Bungalow set on 1 tumolo of land, surrounded with terraces and garden with large pool and deck area. The property comprises an entrance hall, formal lounge/dining room, fully fitted kitchen/breakfast room with all modern appliances, pantry, TV room, 4 double bedrooms (main with en-suite and closet facilities) and main bathroom. Complementing the property is a 4 car garage at basement level plus a flat let, workshop area and storage space. Highly recommended.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "006304", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Mellieha", "price": "€1,350,000", "description": "Built on approximately 1.3 tumoli, large fully detached BUNGALOW with very good sea views, drive way, hallway, sitting room, dining area, kitchen and living area, 3 double bedrooms, 2 bathroom (1 en suite) and 1 car garage. The property also enjoys a huge underlying garden-level basement consisting of kitchen, living room, playroom, gymnasium, shower and large L-shaped conservatory and finally an enormous garden with ample space for pool. Must be seen. Items Included in Price Working fireplace, built in wardrobe, fitted kitchen, several terraces around the property, aviary in garden. Underlying basement consisting of: kitchen 11ft x 14ft, living are 12ft x 25ft, playroom 18ft x 25ft, bedroom 1 15ft x 15ft, bedroom 212ft x 15ft, bedroom 3 15ft x 11ft, shower, gymnasium 22ft x 16ft and living room, 18ft x 13.5ft. (L-shaped room with fitted kitchen and toilet).", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Terrace", "Views", "Shops"]}
{"id": "Bung13421", "type": "bungalow", "title": " Bungalow For Sale in Mellieha", "price": "€950,000", "description": "Bungalow with excellent views of all Santa Maria Estate and Ghadira Bay.  €950,000 is priced for the Bungalow to be built in shell. Plans to be added soon.  Will also sell as a plot for €750,000", "details": {}, "features": []}
{"id": "710261", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Mellieha", "price": "€900,000", "description": "This well positioned, fully detached VILLA in Santa Maria Estate is built on solid rock on a plot just over 1,125 sqm, within walking distance of all amenities, affording unobstructed valley views and distant sea views. The layout is very contemporary, bearing in mind the age of this villa, welcoming you with a large entrance hall, leading to a formal sitting room, combined kitchen and living room overlooking a large terrace offering the mentioned views. Three bedrooms, main bathroom and spare bathroom completes this floor which is surrounded by a mature garden. In the level below, one finds a further living room, gym and enough rooms which could easily convert this level into an independent apartment. Furthermore, a four-car garage, drive-way and a massive garden with plenty of space for a swimming pool and large well complement this level of building. Once modernised, this property will make a lovely home and a sound investment. Must be seen.", "details": {"Bathrooms": "2"}, "features": ["Washroom", "Garage", "Garden", "Back Yard", "Views", "Shops"]}
{"id": "14157", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Attard", "price": "€2,350,000", "description": "A massive Bungalow set on an area of 1430sqms, located in a very good area in Attard. Accommodation comprises of a very large welcoming hall, leading to rooms on both sides, formal sitting room, dining room, guest toilet, 3 bedrooms, main with en suite, main bathroom and laundry room. Complementing this enormous Bungalow is a pool with a spacious deck area and is also surrounded by a garden with mature trees. Included also is a street level 3 car garage.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "4233093", "type": "bungalow", "title": "7 Bedroom Bungalow For Sale in Mellieha", "price": "€1,750,000", "description": "Bungalow - Mellieha. This is a luxurious and expansive bungalow located in Santa Marija Estate in Mellieha built on a plot of 1,300 sqm. and offering views of the bay and the open sea. Access to the property is through the drive-in which takes you to the graciously curved staircase to the house as well as to the 2-car garage on the lower level. This furnished property comprises a sizeable central courtyard, 6 bedrooms (5 of which with en-suite bathroom), lounge, very spacious living room and dining room, kitchen, library and study and a large patio. There is also an underlying one-bedroomed flatlet. It has a well-established garden and a sizeable swimming pool with spacious sundeck.", "details": {"Bathrooms": "5"}, "features": []}
{"id": "410039", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Kalkara", "price": "€830,000", "description": "A semi-detached BUNGALOW, with very good views both sea and country consisting of a wide long hall, lounge, sperate dining room, kitchen, 4 bedrooms, bathroom, shower room, larger than usual laundry room, back yard and a 2 car street level garage and car port. Freehold.", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Garden", "Back Yard", "Balconies", "Terrace", "Views", "Shops"]}
{"id": "16335", "type": "bungalow", "title": "7 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€2,950,000", "description": "San Pawl Ta' Targa Detached Bungalow 1000 sqms approximately, enjoying an abundance of views and natural light. No expense has been spared by it's owner, a lift connects all floors, all walls and ceilings are insulated, with all the living area and garage have under floor heating and cooling, intelligent lighting throughout and an integrated TV system. Property consists of an entrance leading to a spacious open plan living/kitchen/dining, into a sitting/dining area, 4 large bedrooms all with en suite and walk-in closet, separate study, guest toilet and upstairs one finds a washroom which can be used as another living. All rooms are surrounded by a landscaped garden and a large pool were one can entertain and enjoys the view. Complimenting this property is a street level 6+ garage, games room and a 3 bedrooms.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "007579", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Bidnija", "price": "€1,000,000", "description": "Finished DETACHED BUNGALOW situated in one of Malta's most beautiful rural areas enjoying panoramic country views. Accommodation comprises combined sitting/dining room, combined kitchen/living room, 3 double bedrooms, bathroom, shower en suite, 3-car drive in, 1 car garage and a medium sized garden all around. Freehold. PROPERTY IS ALSO TO-LET. Items Included in Price Kitchen cupboards.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Back Yard", "Terrace", "Views", "Shops"]}
{"id": "13039", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mosta", "price": "€950,000", "description": "A well maintained Detached Bungalow with full basement and a large outdoor area. The property comprises a wide welcoming hall, formal lounge area, massive sitting/living, separate kitchen, study, 4 bedrooms, family bathroom, spare toilet and a good-sized back garden with ample space for a pool. Complementing this property is a full semi-basement garage with driveway, a flatlet and a 2 car street-level garage with a second driveway on the other side of the property. Freehold.", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "PP00010181", "type": "bungalow", "title": "4 Bedroom Semi-Detached Bungalow For Sale in St Paul's Bay", "price": "Price on Request", "description": "One time opportunity. Bungalo located just in front of the sea with unobstructed country and sea views . Property measuring 280sqm, consists of 4 bedrooms, 3 bathrooms seperate kitchen and huge open plan living dining with views. Full roof and wash room , three underlying garages that you can fit 9 cars easy .", "details": {"Size": "500sqm", "Bathrooms": "3"}, "features": ["Ordinary Finished"]}
{"id": "W-01D7GP", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mosta", "price": "€953,000", "description": "A centrally located fully detached bungalow built on a plot of nearly 700sqm. The comfortable layout of this bungalow comprises of: An entrance hall Formal sitting room Lounge Fitted kitchen & Dining room Four bedrooms Bathroom Back garden & side car-ports A street-level two car garage. An independent flat let is situated at basement level. The bungalow is situated in the outskirts of the central town and gives easy access to all parts of Malta.", "details": {"Size": "423sqm", "Bathrooms": "1"}, "features": ["Garage", "Marble", "Guest apartment", "Basement"]}
{"id": "3306196", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Madliena", "price": "€3,200,000", "description": "Detached Bungalow - Madliena. Superb detached bungalow in this exclusive and tranquil area of the Mediterranean countryside. Having a welcoming entrance that leads to a reception hall, a formal sitting room with a fireplace and separate dining room. A delightful open plan well fitted kitchen/breakfast/living overlooks a large outside terrace with open sea views. 4 double bedrooms, en suite bathrooms and guest cloakroom. The lower level consists of 10 car garage, games room, and granny flat with a separate entrance. A lovely secluded pool and mature trees surround this superb family home.", "details": {"Bathrooms": "3"}, "features": []}
{"id": "10694", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Attard", "price": "€980,000", "description": "A meticulously finished, spacious Bungalow in a very quiet area of Attard having a large pool, deck area & garden. Comprising a wide welcoming hall leading to Sitting and Dining, separate Kitchen and Living, three large bedrooms, 2 bathrooms, washroom, a gamesroom, a 3 car garage & a 6 car drive.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "PP00018667", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Marsascala", "price": "€3,400,000", "description": "Seafront Villa/Bungalow enjoying a beautiful pool with a large deck area, an enormous luxuriously fitted kitchen/dining, living/sitting, indoor pool, a welcoming entrance, four bedrooms, five bathrooms, enormous games room, Car port and an 8 Car Garage.", "details": {"Size": "1000sqm", "Bathrooms": "5"}, "features": ["Luxuriously Finished", "Yard", "Garden", "Own Roof", "Internet"]}
{"id": "13893", "type": "bungalow", "title": " Bungalow For Sale in Gozo - Marsalforn", "price": "€500,000", "description": "Bungalow or villa to be offered according to the buyer's request, with 2 tumoli of land to go with the property.  The property lies in Zebbug with incredible views over Xaghra, Marsalforn and everything in between.  The price offers the building with the land as it is. Further constructions and finishings can be made at buyer's request.", "details": {"Size": "2000sqm"}, "features": ["Valley View", "Garden", "Airspace", "Unconverted"]}
{"id": "14091", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Marsascala", "price": "€1,285,000", "description": "Large detached Bungalow, situated in a beautiful area in Marsascala, enjoying picturesque sea views. Accommodation comprises of a welcoming entrance hall leading to a spacious living/dining area, with fireplace and separate kitchen overlooking a very nice garden with pool and deck area. Included also with this beautiful house are 4 large double bedrooms, main with en suite, main bathroom, study, laundry room and storage room. Complementing this rare find is an interconnecting 5 car garage.", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "13081", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Attard", "price": "€1,260,000", "description": "Large Bungalow in Attard, in a very quite location with unobstructed views. This property consists of a large dining and living area with fitted kitchen and breakfast room, overlooking back garden with large pool including shower and changing room. Three double bedrooms, main with en suite. A massive basement is present, including a flat let having a kitchen three further double bedrooms a bathroom a games room and living area. Works shop, storage area and side garden, a three car drive in area and a two car lock up garage are included. One time property not to miss if you have the budget!", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "11958", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Ta' l-Ibragg", "price": "€1,650,000", "description": "A dreamhome ! Detached bungalow in the best most quiet area of Victoria Gardens. Property has been built on an area of 1200sqm and enjoys distant seaviews. a massive outdoor area with large pool ideal for entertainment. a manicured garden, very bright, large living areas throughout the residence, study, 3 double bedrooms, fully fitted brand new Kitchen/breakfast with separate dining, underlying flatlet, large garage with 6 car drive.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "PP00019151", "type": "bungalow", "title": "2 Bedroom Bungalow For Sale in Kalkara", "price": "€900,000", "description": "Luxuriously finished Bungalow comprising of an entrance hall, large kitchen/living/dining with French doors leading to an outdoor area with a heated swimming pool with 6 solar panels overlooking the Marina, Valletta, Vittoriosa bastions & the Grand Harbour. Two double bedrooms (main with en-suite & walk in wardrobe), main bathroom, an interconnected 16 car garage, storage room, pump room, private well and a 3 car drive-in. This property has Bianco Carrara marble flooring throughout and solid Eroko apertures. Safety Alarm, fully air-conditioned, another 11 Solar Panels and water heater. Viewing recommended.  This freehold property is being sold highly finished. Viewing is highly recommended! Prominent features; * Stunning Sea views * Highly finished * Bianco Carrara marble flooring * Solid Eroko apertures * Soffit ceilings * Heated swimming pool * Wrought iron gates * Naturally lit * Ample space for entertainment * Safety Alarms * Solar panels * Solar h", "details": {"Size": "275sqm", "Bathrooms": "2"}, "features": ["Luxuriously Finished", "Yard", "Garden", "Own Roof"]}
{"id": "13596", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mosta", "price": "€575,000", "description": "bungalow to be sold in shell form having large open plan kitchen/living/dining, 3 double bedrooms, ensuite, walk in wardrobe, main bathroom, yard with pool, washroom and full airspace", "details": {}, "features": []}
{"id": "10652", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€2,200,000", "description": "Design concept bungalows with a spacious outdoors pool and deck area built on an area of prox 590sqms enjoying distant sea & country views. Accommodation comprises of a well lit entrance hall, spacious combined open plan living/dining/ kitchen with pantry, guest bathroom, 3 double bedrooms all with en suite and walk in wardrobes. 3 car garage.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "813179", "type": "bungalow", "title": "3 Bedroom Terraced Bungalow For Sale in Siggiewi", "price": "€744,000", "description": "An elevated corner terraced BUNGALOW covering an area of 340sqm, located in a quiet location in the tranquil village of Siggiewi. Accommodation consisting of a wide entrance hallway leading onto a formal sitting room, a large combined kitchen and dining room, three bedrooms, large back garden, one shower room and one bathroom. Property also benefits from an interconnecting 3-car garage included in the price and ownership of roof. FREEHOLD", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Views", "Shops"]}
{"id": "13224", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Wardija", "price": "€3,000,000", "description": "Wardija outskirts / Tal Fjuri - Massive fully Detached bungalow built on over a Tumolo and situated on high grounds enjoying fantastic panoramic sea and country views from all rooms and terraces. This spacious accommodation includes a wide entrance hall, large sitting room, dining room, combined kitchen/breakfast/living room, 5 bedrooms, 4 bathrooms, 3 separate shower rooms, laundry room and 2 separate flatlets overlying each other. Each flatlet consists of 2 bedrooms and a large living room. All rooms on the upper floor level are surrounding a large central courtyard. This property is served with a lift which connects all four that include 2 large workshops, study room, play room, snooker hall and a large indoor swimming pool. Complementing this property is a very large terraced garden and a four car lock-up garage.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "911786", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€9,000,000", "description": "Modern and tastefully decorated FULLY DETACHED BUNGALOW, boasting of a prime location within Santa Maria Estate and enjoying total privacy and fantastic open sea views. This home is finished to the highest specifications with intelligent lighting, surround sound systems, a modern open fireplace in the main lounge, two other fireplaces in separate living rooms, and a gorgeous pool and entertainment area, complete with lounge areas and a fully equipped outdoor kitchen and bar. The main accommodation comprises a welcoming hallway, sitting room, dining room that can seat twenty people comfortably, living room, kitchen and 3 double bedrooms - all having en-suite facilities. Further accommodation includes a cinema room, study, wine cellar, a fully equipped gymnasium and a 2 - 3 car garage. This house is absolutely ready to move into and would make an excellent home to any family. Contact our offices for further details. Items Included in Price Very highly finished kitchen, fully equipped kitchen, wine cellar and bar at pool level. Wine Cellar.", "details": {"Bathrooms": "2"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Views", "Shops"]}
{"id": "414780", "type": "bungalow", "title": "3 Bedroom Terraced Bungalow For Sale in Paola", "price": "€743,000", "description": "Elevated TERRACED BUNGALOW situated near the outskirts of this town. Property has a footprint covering approximately 34 x 91ft. Accommodation consists of a wide hallway and lateral rooms on each side, formal lounge and dining, three double bedrooms, two internal yards, bathroom, combined kitchen/living and dining room overlooking a spacious backyard, two rooms at roof level, and full ownership of roof and airspace. Further complementing this property is an underlying 9 car semi-basement garage. Items Included in Price Plot size: 34ft x 91ft; garage 40ft x 36ft - 9 car.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Back Yard", "Airconditioning", "Shops"]}
{"id": "14067", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Attard", "price": "€760,000", "description": "Highly finished and spacious Bungalow, situated in a very nice area in Attard. Property consists of welcoming entrance hall, formal dining room, fully fitted kitchen/living, 3 bedrooms, main with en suite, main bathroom, having its own full roof/airspace. Included also is a solar water heater and air condition units in living area and all bedrooms. Complementing this lovely property is a side yard and a good size back yard, flatlet and a 2 car garage with car port with ample space for parking.", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "13449", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€1,400,000", "description": "Very large Villa comprising of a large hallway, study, kitchen, large terrace overlooking the pool area. Views all round. Dining, living and sitting room overlooking the pool area. This unique property includes a 4 bedroom (main with ensuite), washroom and a wine cellar with office space. Plenty of space and a large private pool area compliments this property being sold as a shell form.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "451615", "type": "bungalow", "title": "4 Bedroom Detached Bungalow For Sale in Naxxar", "price": "€1,850,000", "description": "Description Delightful detached BUNGALOW in this highly sought after residential area. Built on approximately 1 tumolo and having a substantial mature garden and exquisite views. Layout comprises an entrance hall, combined kitchen/living/dining which open up onto the pool and deck area, formal sitting and dining room, 4 double bedrooms, guest bathroom, guest toilet, 2 shower rooms en-suite and a washroom. A wide surrounding terrace leads to both the garden and the pool and deck area which are ideal for entertaining. Property benefits from an interconnecting 2 car garage, gym and an underlying fully independent 2 bedroom flat let. Freehold Items Included in Price kitchen and appliances, A/C units, 19 PV Panels", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Balconies", "Views", "Airconditioning", "Shops"]}
{"id": "PP00019130", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mellieha", "price": "€1,300,000", "description": "18 roomed detached bungalow. Four bedrooms, two spacious kitchens and four bathrooms. This property has a very large garden with more than enough space for two big pools. Garage is also included in the price.", "details": {"Bathrooms": "4"}, "features": ["Ordinary Finished", "Yard", "Garden"]}
{"id": "812977", "type": "bungalow", "title": "5 Bedroom Semi-Detached Bungalow For Sale in San Gwann", "price": "€855,000", "description": "Owner built and finished Semi Detached BUNGALOW enjoying open country and valley views, situated in this tranquil yet very central location. This very well kept property is built on a plot of land measuring approx 315 sqm, comprising of a combined sitting and dining room, fully fitted oak kitchen/b'fast/living room leading onto a good sized corner terrace, 5 bedrooms, 3 bathrooms (2 of which are en suite), guest toilet, store room, study room, laundry room at roof level, front and back garden with mature fruit trees, driveway and a large one car lock up garage. Complimenting this residence one finds a solar water heater system, a well connected to an irrigation system, air-conditioning units etc. FREEHOLD. Items Included in Price 2 air conditioning units, fully fitted kitchen, solar water heater, kitchen table not included; CCTV system.", "details": {"Bathrooms": "3"}, "features": ["Washroom", "Garage", "Garden", "Balconies", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "411312", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Birkirkara", "price": "€950,000", "description": "Situated in an extremely quiet and desirable area comes this corner, four bedrooms BUNGALOW. Layout consists of a welcoming reception, four double bedrooms of which two enjoy an ensuite bathrooms, massive family bathroom, an internal yard, washroom, separate kitchen/dining room and separate living. Staircase leading onto an interconnected semi basement, 11 car garage with well. Property is surrounded by a beautiful front garden. Also enjoying a side terrace overlooking the front garden. Property is offered for sale completely finished and furnished. Must be seen. Items Included in Price Fully furnished.", "details": {"Bathrooms": "1"}, "features": ["Washroom", "Garage", "Terrace", "Airconditioning", "Shops"]}
{"id": "11222", "type": "bungalow", "title": " Bungalow For Sale in Bahar Ic-Caghaq", "price": "€5,300,000", "description": "one in a million ! Built on 2 tumoli enjoying sea and country views is this beautiful bungalow. Wide entrance hall, cloakroom, lateral living room, dining room, gym, large lounge/reception area with games room, leading to a spacious kitchen/breakfast room overlooking a sunny terrace offering easy access to a large pool, deck, and bbq area. Sleeping quarters comprise of 5 large bedrooms, 2 with en suite bathrooms, 3 separate flat lets totaling 4 more bedrooms all with en suite finish.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "11346", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Madliena", "price": "€4,000,000", "description": "Fully Detached Bungalow with massive pool & large entertaining areas, enjoying breathtaking sea and country views. Having an elegant entrance leading into a huge lounge and dining room, a fully equipped kitchen/breakfast with lounge area, 3 double bedrooms all with en suite bathrooms, main with walk in wardrobe, guest toilet. Further complimenting this property is an independent, 3 car garage, utility rooms and drive.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "10646", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€2,800,000", "description": "Highly finished Bungalow set on over a tumolo with large pool and mature garden enjoying sea and country views. Spacious accommodation featuring a grand hallway, formal sitting / dining room with fireplace, surrounding large terraces. 4 bedrooms, 3 bathrooms, 2 separate flatlets, gym, billiard room, large carport and 10 car garage/basement.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "14044", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Rabat", "price": "€1,400,000", "description": "A one in a million, Highly finished very large Bungalow set on an area of land in total measuring 1300 square meters in this much sought after area of Rabat enjoying full unobstructed country views. Property consists of a welcoming hall leading to a spacious kitchen/living/dining with entertaining area, sitting room and games room. Furthermore, accommodation includes another formal sitting/dining, 3 double bedrooms, study, main bathroom, kitchen/sitting/dining, large balconies having its own full roof/airspace including a solar water heater and PV Panels. Complementing this nice property is a very large outdoor space with pool and deck area, large storage room and a large garage with carport having ample space for 12 cars or more. Freehold.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "9684", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Madliena", "price": "€3,500,000", "description": "Every Designer's dream! This modern concept bungalow having excellent attention to detail throughout. enjoying landscaped gardens, manicured lawn, large outdoor entertaining area with pool, BBQ /Bar deck areas, open plan living/dining/kitchen overlooking the pool, 4 bedrooms, gym and cinema room. massive garage and drive. So unique!", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "11328", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bahrija", "price": "€880,000", "description": "Bungalow built in the countryside over a tumolo of land enjoying unobstructed views & tranquility. Property comprises a very bright living /dining / kitchen, 3 double bedrooms, larger than usual bathroom, washroom and own roof. 8 car drive leading to 2 garages. Freehold. An ideal family home !", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "JST9356", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mosta", "price": "€896,000", "description": "MOSTA – This fully detached Bungalow is set in one of Mosta’s most desirable areas, close to all amenities and in front of green area. As one enters we find a very welcoming and bright area that is currently used as a kitchen and dining area, though could make a lovely and bright area all set on open plan. Moving on we find the main bedroom and another double bedroom. The third single bedroom is currently used as a Study. At the back we find a good sized garden with ample space for a pool. The great feature about this house is the enormous basement that was planned and built as a small printing press. Further in we also find another small area used as a kitchen / living area. On one side of the house we find a two car garage that leads on to a drive in, that could easily accommodate another 3 cars. This bungalow is full of potential and could be turned into one beautiful home.", "details": {"Bathrooms": "2"}, "features": ["Interconnected Garage"]}
{"id": "PP00018291", "type": "bungalow", "title": "5 Bedroom Semi-Detached Bungalow For Sale in San Gwann", "price": "€899,000", "description": "Semidetached Bungalow, built and finished by owner. Enjoying open country and valley views and situated in a tranquil yet central location. Combined sitting/dining room, fully fitted oak kitchen/breakfast/living leading onto a good sized corner terrace. 5 bedrooms, 3 bathrooms, guest toilet, store room, study room and a washroom at roof level. Front and back garden, driveway and large 1 car lock-up garage. Ownership of roof and airspace. Solar water heater system, a well connected to an irrigation system, 2 A/C's and CCTV camera.", "details": {"Size": "470sqm", "Bathrooms": "3"}, "features": ["Ordinary Finished", "Yard", "Garden", "Own Roof"]}
{"id": "Bung8745", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mosta", "price": "€875,000", "description": "A well kept fully detached bungalow enjoying a 65ft frontage and 120ft depth. Property is built on 2 plots and enjoys a tremendous amount of living space, including a large basement and garden. Ideal for a large family! Highly recommended.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Garden", "Basement", "Study", "Wine cellar", "Flatlet", "Utility/boxroom", "Car capacity"]}
{"id": "FDB124", "type": "bungalow", "title": " Bungalow For Sale in Rabat", "price": "€928,000", "description": "Bahrija- On the market is this 2000sqm fully detached bungalow, totally surrounded by country overlooking beautiful valley views. Accommodation comprises of bright entrance hall, spacious and bright living/dining room overlooking the garden.", "details": {}, "features": []}
{"id": "240071055-121", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Siggiewi", "price": "€863,380", "description": "In this quiet area, we find this corner bungalow with 95ft frontage and would be also ideal for development. This hard to come by bungalow is spacious and also bright thanks to a sky light that lets natural light in. This house consists of a kitchen/living/dining, 5 bedrooms,washroom and full roof. House has a surrounding garden and comes also complete with a 4 car semi basement garage another 2 single car garages and a 40ft workshop all found beneath property. This great property would make a great investment as it could be developed into one great block.", "details": {"Size": "1520sqm", "Bathrooms": "3"}, "features": ["Roof (Full)", "Near Bus", "Near Children's Park", "Near Church", "5+ Car Garage"]}
{"id": "10260", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Lija", "price": "€1,200,000", "description": "A countryside Bungalow with pool, still in shell form, set on over 1,100 sqm of land. The property comprises a large hallway, combined living/kitchen/dining, 3 bedrooms (main with en-suite), washroom, games room and car port. An adjacent plot is also available.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "11309", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in San Gwann", "price": "€910,000", "description": "A beautiful semi detached bungalow enjoying far reaching country and sea views, built on an area of approximately 340 sqm. This bungalow overlooks the Valley and is situated in a sought after area enjoying peace and tranquility. It is very well kept by its current owners and is in impeccable form. Location is great as it is within walking distance to Spinola Bay, St Julians and around a 30 minute walk to Sliema.  Upon entering, one finds an entrance hall complimented with a formal combined dining and sitting room, leading onto a balcony overlooking the front garden. On this same floor, one also finds the main bedroom with ensuite, a guest toilet, a small box room and a large open kitchen / living / dining area. This main living area is over looking the valley and enjoys impressive views as well as plenty of natural light and fresh air. It leads onto a large corner terrace, perfect for entertaining, where one can appreciate the sunset daily.  Just off the entrance hall, a beautiful wooden stair case leads downstairs to an equally large area which could easily be converted into a flatlet with its own separate entrance. Down here, one finds 4 large bedrooms (one with ensuite, one with a walk in wardrobe and one which could be turned into a study area), another open plan and a spacious main bathroom. This whole area is surrounded by a mature garden and is also flooded with natural light. This property is also complemented with an interconnecting one car garage and a drive in that can fit 3 cars.  Airspace is included in the price and there is also the possibility of building another floor on top. Other features included are, CCTV system, a water well (95,000 ltrs) connected to an irrigation system and pumps, air condition units and a solar water heater. This property is being sold semi furnished. This is negotiable.  This property must be viewed to be truly appreciated.", "details": {"Size": "312sqm"}, "features": ["Sea View", "Valley View", "Terrace", "Balcony", "Yard", "Garage", "Parking Space", "Furnished", "Air Conditioning", "Garden", "Open Plan", "Study", "Utility Room", "Airspace", "Semi Detached", "Freehold", "Finished", "Whole Roof", "Pet Friendly"]}
{"id": "3233400", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Mosta", "price": "€947,000", "description": "Fully detached Bungalow located in Mosta. Consisting of a separate kitchen and pantry, living room, sitting room, dining room, 4 bedrooms, bathroom. There are front and back gardens measuring 56 ft x 20 ft. A drive way leading to a 2 car garage and an underlying basement / flatlet is also interconnected to the house. Freehold.", "details": {"Bathrooms": "2"}, "features": []}
{"id": "Bung9939", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Siggiewi", "price": "€635,000", "description": "Three bedroom, finished terraced bungalow (33ft x 110ft) in this quiet part of Siggiewi. Property boasts of living room, 3 bedrooms, kitchen/dining room, 2 bathrooms. At the back one finds a large yard with a small garden. A 2 car garage is included in this property together with wash room, own roof and airspace.", "details": {"Bathrooms": "2"}, "features": ["Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Yard", "Garden", "Roof"]}
{"id": "14791", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Mellieha", "price": "€1,800,000", "description": "This is a luxurious Bungalow located in Santa Marija Estate in Mellieha built on a plot of 1,300 sq. m. and offering views of the bay and the open sea. Access to the property is through the drive-in which takes you to the graciously curved staircase to the house as well as to the 2-car garage on the lower level. This furnished property comprises a sizeable central courtyard, 6 bedrooms (5 of which with en-suite bathroom), lounge, very spacious living room and dining room, kitchen, library and study and a large patio. There is also an underlying one-bedroom flatlet. It has a well established garden and a sizeable swimming pool with spacious sundeck.", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "PP00003362", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Kappara", "price": "€860,000", "description": "Luxurious elevated bungalow, impeccably maintained. Situated in an elite and quiet area, enjoying country and distant views of the Grand Harbour. A spacious welcoming hall with gold embroidered tiles leads to the living quarters with three double bedrooms with windows opening onto a lovely garden and drive-in, and a living/kitchen, lounge dining, corridor and bathroom. Underneath is a four car garage. With minimal alterations property can be converted into two spacious semi-detached luxurious residences.", "details": {"Size": "175sqm", "Bathrooms": "3"}, "features": ["Luxuriously Finished", "Yard", "Garden", "Own Roof"]}
{"id": "911743", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,800,000", "description": "Highly finished, fully detached, very spacious BUNGALOW located at the top part of this prestigious villa estate, within walking distance to all the shops. The house enjoys ample outdoor space and open views. The main accommodation comprises large hallways, combined sitting/dining room, large fully fitted kitchen and living room, 3 double bedrooms and 2 bathrooms. Underlying the house is a large flatlet and games room. Below that is a garage with entrance from another street large enough to take around 10 cars or even boat storage. Must be seen.", "details": {"Bathrooms": "2"}, "features": ["Washroom", "Garage", "Swimming Pool", "Garden", "Terrace", "Views", "Airconditioning", "Shops"]}
{"id": "14887", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,260,000", "description": "Beautiful Villa with 3 bedrooms,3 en suite,2 bathrooms,kitchen,dinning room,storage room,living room,hall,swimming pool ,garden and garage for 7 cars. All the Villa Area is Double insulated, 3 water Wells, Various Granite Flooring and Fantastic Sea Views", "details": {}, "features": ["Outdoors", "Swimming Pool", "Garage"]}
{"id": "Bung3898", "type": "bungalow", "title": " Bungalow For Sale in Naxxar", "price": "€540,000", "description": "Very sweet Corner Bungalow elegant entrance hall, bright sitting room, newly fitted kitchen, spacious living room, 3 bedrooms, 2 bathrooms, large terrace, tool room, street level 4 car garage.", "details": {}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Basement", "Roof", "Car capacity"]}
{"id": "Bung13226", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mellieha", "price": "€1,250,000", "description": "An impeccably kept detached cottage / bungalow set on over 1000sqm enjoying unobstructed area, guaranteed 180 degree views. Comprising entrance into hallway, formal dining / living room enjoying outstanding views, separate everyday living / breakfast and a separate fitted kitchen, all rooms with walkout onto outdoors with pool and deck area. 3 - 4 bedrooms, study, annex and much much more. Property is in need of minor modernizing. Highly recommended.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Sea views", "Fireplace", "Wine cellar", "Terrace", "Flatlet", "Country views", "Utility/boxroom"]}
{"id": "PP00002534", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Attard", "price": "€1,163,522", "description": "Luxuriously corner finished and furnished Bungalow, comprising a welcome hall, kitchen/breakfast, sitting/dining, 2 bathrooms, utility room, wash room,4 bedrooms one with en-suit and a walkin wardrobe, front garden, back yard with a space of a pool, 2 drive in and a garage. property is finished to high specifications and fully airconditioned.", "details": {"Bathrooms": "2"}, "features": ["Luxuriously Finished", "Yard", "Garden", "Own Roof", "Internet"]}
{"id": "TBG8255", "type": "bungalow", "title": "3 Bedroom Terraced Bungalow For Sale in Marsascala", "price": "€1,150,000", "description": "MARSASCALA - A hard to find and meticulously finished, ready to move into FULLY-DETACHED BUNGALOW, set on approximately 700sqm of land, enjoying magnificent sea views. Layout comprises of a very welcoming entrance hall and a massive squarish living room facing a picturesque internal yard. The sitting room leads to three double bedrooms, main one with en-suite, balcony and bathroom embellished with a jacuzzi. Separate fitted kitchen/dining overlooking a mature garden, well-sized south facing pool, ample deck and barbeque area, spare toilet with shower and laundry room. This very interesting residence is complimented with a three-car port and a two-car interconnected garage at semi-basement level which can be enlarged to fit fifteen cars and a couple of offices or a massive storage space which can be altered to a flat-let. Viewings are highly recommended. Property must be seen to be appreciated!", "details": {"Size": "159sqm", "Bathrooms": "2"}, "features": []}
{"id": "11512", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Madliena", "price": "€1,200,000", "description": "LM 661,000 Semi detached bungalow set in a much sought after area. Comprising of entrance hall, dining room, sitting room with fireplace, 3 bedrooms, ensuite, bathroom, fitted kitchen/living/dining leading to a large pool and deck area and 3 car garage. Airspace can also be developed For more information call Marise 7927 8517", "details": {}, "features": []}
{"id": "W-01D97M", "type": "bungalow", "title": "2 Bedroom Bungalow For Sale in Xghajra", "price": "€987,000", "description": "Detached Bungalow on the outskirts of this village set on five tumoli of land. Situated in the center of a green area commanding 360 degrees country views and distant sea views, the property is 25 feet x 155 feet on two roads and having a large garden measuring 250 feet x 225 feet. The property comprises of : Kitchen/dining/living room 2 bedrooms 1 Bathroom Stables for horses 9 car garage and stables for horses This large detached bungalow in Xghajra is has a total layout of 5,226 sqm. For more information about this property, contact the number provided above or visit one of our lounges located around Malta.", "details": {"Size": "360sqm", "Bathrooms": "1"}, "features": ["Garage", "Tiles", "Garden"]}
{"id": "TBG4320", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mosta", "price": "€952,000", "description": "Opportunity to have this luxuriously finished fully detached Bungalow which set on plot measuring 65 feet by 135 feet. A very wide entrance hall welcomes you when you enter the property, leading you to two formal sitting areas along with a tasteful dining area, the wonderful property also comprises of a very nice kitchen and four bedrooms. Then you will find a long stairs leading to a massive basement which have another kitchen and study room and offers ample storage and work spaces which is ideal to become a homely Gym. From the outside, a slightly sloped ramp leads to the basement, whilst another drive way leads to a street level two car garage. This sought-after Bungalow also have a inspiring garden with two wells which allowed you easily to convert it to a swimming pool. This premium property welcomes you to view it anytime.", "details": {"Size": "650sqm", "Bathrooms": "1"}, "features": []}
{"id": "240071055-31", "type": "bungalow", "title": "2 Bedroom Bungalow For Sale in Mosta", "price": "€950,000", "description": "This fully detached Bungalow is set in one of Mosta's most desirable areas, close to all amenities and in front of green area. As one enters we find a very welcoming and bright area that is currently used as a kitchen and dining area, though could make a lovely and bright area all set on open plan. Moving on we find the main bedroom and another double bedroom. The third single bedroom is currently used as a Study. At the back we find a good sized garden with ample space for a pool. The great feature about this house is the enormous basement that was planned and built as a small printing press. Further in we also find another small area used as a kitchen / living area. On one side of the house we find a two car garage that leads on to a drive in, that could easily accommodate another 3 cars. This bungalow is full of potential and could be turned into one beautiful home.", "details": {"Size": "650sqm", "Bathrooms": "2"}, "features": ["Air Space", "Garden", "Well", "Unfurnished", "Phone", "TV"]}
{"id": "Bung6655", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bahrija", "price": "€975,000", "description": "A well-kept fully detached bungalow set on approximately 1.7 tumoli enjoying unobstructed 360 degree country views set in this most tranquil and picturesque village. Comprising of a large hallway, separate fitted kitchen / dining, living room with walkout onto back garden with ample space for pool and deck area. 3 bedrooms, ensuite, washroom, box room, tool shed, large well, terraces and a two 1 car lock up garage. Highly recommended!", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Terrace", "Utility/boxroom", "Car capacity", "Balcony"]}
{"id": "PE13", "type": "bungalow", "title": " Bungalow For Sale in Zabbar", "price": "€975,000", "description": "Large double fronted, corner fully detached bungalow, on a wide main road, in prime area of Zabbar outskirts, enjoying country views , ideal residential or commercial outlet. Category 1. FREEHOLD.", "details": {"Size": "2000sqm"}, "features": ["Centrally Located", "Corner Building", "Country Views", "Views"]}
{"id": "Bung10467", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€1,330,000", "description": "Bungalow set on 1,040sqm in the best area of this sought after town. This property comprises a large L-shaped living / dining / sitting area, large kitchen, main bathroom, study, 3 double bedrooms, guest bathroom and an interconnecting flat let consisting of a kitchenette, bathroom and bedroom. This property enjoys a 6 car driveway and a street level 6 car garage. Outside one finds a large pool, BBQ area and large pool area enjoying spectacular sea views. This property is ideal for a family or people who like to entertain. Highly recommended!", "details": {"Bathrooms": "2"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Pool", "Study", "Roof", "Sea views", "Terrace", "Flatlet", "Utility/boxroom"]}
{"id": "Bung10204", "type": "bungalow", "title": " Bungalow For Sale in Mellieha", "price": "€1,330,000", "description": "A huge bungalow with super views of Selmun and Mellieha bays. This house is 1 tumolo and 350sqm with a huge surrounding garden. It is very spacious, airy and very well kept, although in need of some modernization. Layout comprises of a large entrance hall, large formal room, separate kitchen and extra breakfast area with views. It also boasts of 2 separate flat lets and a large garage.", "details": {}, "features": ["Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Garden", "Fireplace", "Flatlet"]}
{"id": "16111", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsaxlokk", "price": "€650,000", "description": "A charming bungalow set on a plot size of 440m2 a stone throws away for the beach, having close sea views this property consists of a welcoming entrance with an office and a large living/dining and a spacious kitchen. Three double bedrooms, main with en suite. A large six car garage with storage space and a nice surrounding garden with space for pool. This property is very well maintained and ready to move into.", "details": {}, "features": ["Outdoors", "Garage"]}
{"id": "19452", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€950,000", "description": "A large Detached Bungalow situated in the much sought after residential villa area which overlooks Santa Maria Estate which will make a wonderful family home. Situated close to all amenities as well as the sandy beaches in Malta and the Gozo ferry. With fantastic far reaching sea and country views, it has truly amazing summer sunsets over the horizon from the large area surrounding the property. Property layout comprises of a welcoming hall way that leads to the very spacious sitting room and kitchen/dining area, both leading to the large pool area. The hallway also leads to the study, three large double bedrooms all with ensuite, the master bedroom also has a walk in wardrobe. Lovely property is being sold in shell form.", "details": {"Bathrooms": "4"}, "features": ["Open Plan"]}
{"id": "16648", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,275,000", "description": "Charming bungalow located in the sought after area of Santa Maria estate in Mellieha, close to all amenities and just 5 minutes away from the sea. This property comprises of 3 bedrooms with ensuite in master bedroom, seperate bathroom, kitchen with lots of storage and seperate pantry, washroom,seperate dining room, lounge area. A large terrace leading to a fabulous pool area surrounded by a mature garden and stunning views of Mellieha Bay. Drive -in leading to a large garage with availability for installation of a lift.", "details": {"Bathrooms": "2"}, "features": []}
{"id": "Bung5464", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Lija", "price": "€1,325,000", "description": "Being sold in shell form! A newly built country residence enjoying 1700sqm of land and having fantastic unobstructed country views. Comprising of an entrance into large bright hallway, open plan kitchen / living / dining overlooking the pool, 3 bedrooms, walk-in wardrobe, ensuite, and washroom and games room. 3 car drive.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Pool", "Study", "Roof", "Fireplace", "Wine cellar", "Terrace", "Country views", "Car capacity", "Balcony"]}
{"id": "3419754", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Mellieha", "price": "€1,350,000", "description": "Bungalow - Mellieha. A Lovely bungalow in this sought after area set on a plot of land measuring approximately 1352sqm. The property consists of large welcoming hall, sitting room, dining room, kitchen, breakfast room, study, spare toilet, 4 bedrooms, 3 bathrooms (one en suite), wc, boxroom, washroom, garage, car-port for 5 cars, mature garden, large tool shed, plenty of space for a pool and magnificent views. This property has the potential to be converted into a bungalow and two flatlets. Definitely worth viewing!", "details": {"Bathrooms": "4"}, "features": []}
{"id": "Bung8831", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Birguma", "price": "€1,271,000", "description": "A shell form or finished semi-detached bungalow over approximately 550sqm enjoying distant views and large pool and deck area. Comprises entrance into bright modern hallway, large combined kitchen / living / dining with walk-out onto outdoors. Three bedrooms en-suite, main bathroom, guest toilet, flatlet, games room, secondary living area and a 4 car lock-up garage. Highly recommended.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Roof", "Sea views", "Terrace", "Flatlet", "Country views", "Utility/boxroom", "Car capacity", "Balcony"]}
{"id": "16422", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Madliena", "price": "€1,250,000", "description": "This stunning semi detached bungalow is centrally situated in the sought after location of Madliena.This property comprises of a small hall with an open plan lounge area with fireplace, seperate dining room, seperate bathroom. Kitchen /living room with fireplace. Three double bedrooms with ensuite in master bedroom. Large pool and mature garden area. garage available.", "details": {"Size": "600sqm", "Bathrooms": "2"}, "features": []}
{"id": "W-01HQCX", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,280,000", "description": "A fully detached BUNGALOW for sale in Malta built on 2,200 sqm of land accessible from two diferrent roads. Accomodation comprises of: entrance hall fully fitted kitchen/breakfast dining/ living room three bedrooms bathroom A beautiful swimming pool with ample deck area. A large garden and a very spacious garage with several storage rooms compliments this attractive property. Call us today to book your viewing!", "details": {"Bathrooms": "1"}, "features": ["Garage", "Marble", "Swimming pool", "Garden", "Built-in Kitchen"]}
{"id": "9407", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Birguma", "price": "€1,275,000", "description": "Semi detached bungalow enjoying views built on a plot of circa 630 sqr mtrs. This bungalow is being sold highly finished including pool, deck area and Air conditioners in each room. Layout comprises an entrance hall, open plan kitchen/living/dining leading to a pool and deck area, 3 bedrooms, ensuite, walk in wardrobe, bathroom, large games room and underlying 8 car garage. Must be seen For more information call Andy Stowne 2158 0400", "details": {}, "features": []}
{"id": "W-0258WW", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Rabat", "price": "€1,250,000", "description": "Bungalow on a plot of land of over 1400m2. Great opportunity to renovate or build your own dream home in this very tranquil area in Limits of Rabat. Consisting of: Kitchen, Dining and Living room 3 Bedrooms 2 Bathrooms Large Study 2 Garages Property benefits from a garden magnificently possibility for a large with large swimming pool. Must be seen at this great price soon.", "details": {"Size": "300sqm", "Bathrooms": "2"}, "features": ["Garage", "Balcony", "Sea/lake view"]}
{"id": "Bung4310", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bidnija", "price": "€1,500,000", "description": "Dream location a detached bungalow, surrounded by open country views, very rural location, with a massive garden, total area approximately 1700sqm. Featuring welcoming hallway, spacious sitting/dining, seperate fitted kitchen, 3 double bedrooms, ensuite, 2 car garage, car port, ample space for pool or entertaining. Viewing is a must!", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Car capacity", "Balcony"]}
{"id": "240121010-541", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,435,000", "description": "SANTA MARIA ESTATE-A magnificent bungalow offered in shell form enjoying sea views. This tranquil resort style hideaway is ideal for anyone after true luxury living guaranteed complete comfort and privacy. This wonderful property accommodates three bedroom master with en-suite and , a large open plan living /kitchen/dining. Lower level has a separate gym and games room, large 40sqm pool and adjacent a kitchen/living/dining. All levels enjoy sea views. The property has a two car garage and a very large surrounding garden. It is built on a tumolo of land 1124sqm", "details": {"Size": "1124sqm", "Bathrooms": "3"}, "features": ["Swimming Pool", "Shell Form", "Entrance Hall", "Sea View", "Interconnected Garage"]}
{"id": "3617665", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Mellieha", "price": "€1,400,000", "description": "Bungalow - Mellieha. This is a luxurious bungalow located in Santa Marija Estate. Built on a plot of 1,500 sqm and offering views of the bay and the open sea. Access to the property is through the drive-in which takes you to the graciously curved staircase to the house as well as to the 2-car garage on the lower level. This furnished property comprises a sizeable central courtyard, 5 bedrooms, 5 en suites, lounge, very spacious living room, dining room, kitchen, library, study and a large patio. Complimenting this property is an underlying one-bedroom flatlet, a mature garden and a sizeable swimming pool with spacious sundeck.", "details": {"Bathrooms": "5"}, "features": []}
{"id": "PP00016123", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Iklin", "price": "€1,350,000", "description": "Beautiful Fully detached Bungalow in sought after area in Iklin. Highly finished to great standards. First floor comprising of a large welcoming hall with dining/living area, main bathroom, very spacious fitted kitchen with breakfast and lounge, 3 double bedrooms, main with large ensuite. At basement level a full flatlet including a new fitted kitchen with lounge, main bathroom and a further 2 double bedrooms, main with large en-suite. A large swimming pool, bbq/entertaining area and a large back garden full of citrus trees. Complimenting this property is a large drive inn and an 8 car garage. Open country views and garden. It is set on a tumola of land. Freehold.", "details": {"Size": "1100sqm", "Bathrooms": "3"}, "features": ["Luxuriously Finished"]}
{"id": "Bung9574", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,425,000", "description": "Luxuriously furnished elevated bungalow set in the highly sought after area of Santa Marija Estate. Outside this exquisite property one finds a larger than normal pool deck with 2 pools complete with showers and bbq area, Inside this property one finds a welcoming entrance and a central conservatory, study, 3 double bedrooms all with en-suite and terraces, main bathroom, spacious fully equipped kitchen/living/dining room leading to a back terrace and a garden together with shed. Underlying this property one finds 2 separate flat lets (5 bedrooms) being sold fully furnished. Surrounding the property is a mature garden and a 10 car garage is included!", "details": {"Bathrooms": "7"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Pool", "Study", "Roof", "Sea views", "Terrace", "Flatlet", "Balcony"]}
{"id": "Bung5638", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,450,000", "description": "A well finished detached bungalow boasting unobstructed sea views set in this most sought after and tranquil villa area. Entrance into elegant hallway, spacious sitting room, dining room with walkout onto pool area, separate fully fitted kitchen, 3 double bedrooms ensuite, spa, games room, full basement and drive. Highly recommended.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Sea views", "Terrace", "Flatlet", "Country views", "Utility/boxroom", "Car capacity", "Balcony"]}
{"id": "11829", "type": "bungalow", "title": "2 Bedroom Bungalow For Sale in Ta' l-Ibragg", "price": "€1,650,000", "description": "A true amazing fully detached Bungalow in the much sought after location. Layout comprising an imposing entrance hall, formal sitting room, formal dinng room, fitted kitchen/dining overlooking terrace and pool deck area, living room, guest bathroom, 3 double bedrooms main ensuite and walk in wardrobe. All rooms enjoying privacy and boast lots of natural light. Further complimenting this property is a 2 bedroom flatlet, with another fitted kitchen/living/dining, bathroom and 2 car garage. This property is built on a plot of circa 1.2 tumoli For more information call Marise 7927 8517", "details": {}, "features": []}
{"id": "PP00018346", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€1,380,000", "description": "Exceptionally well located detached bungalow with unobstructed breathtaking views of the open sea. Property is being sold finished. Layout includes a welcoming hallway, an open plan living/dining, kitchen, 3 large bedrooms two bedrooms, study, flat let, entertainment room, swimming pool, BBQ and deck area, outside garden, 6 car garage and 6 car ports. worth viewing.", "details": {"Size": "1038sqm", "Bathrooms": "2"}, "features": ["Ordinary Finished", "Yard", "Garden", "Own Roof"]}
{"id": "Bung5510", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Mellieha", "price": "€1,385,000", "description": "Elevated bungalow built on approximately 1300sqm enjoying beautiful open sea views and stunning backdrop of Mellieha cliffs. An elegant drive way reached to the main door and garage. Elegant entrance hall, leading onto a formal sitting with bay window overlooking the pool and deck area. Large living / dining leading onto a beautiful shaded terrace enjoying the views. Fully fitted kitchen / breakfast, 4 bedrooms (main ensuite) and a further 2 bedrooms in the basement flatlet. A truly elegant home.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Basement", "Pool", "Study", "Sea views", "Fireplace", "Terrace", "Flatlet", "Country views", "Utility/boxroom", "Car capacity", "Balcony"]}
{"id": "Bung4808", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€1,747,000", "description": "Extremely well finished bungalow with large pool and deck area seconds away from the promenade, facing a public square. Accomodation comprising of a hall, sitting room with fireplace, dining room, fitted luxury kitchen, 3 double bedrooms, ensuite and an underlying 4 car garage. Freehold.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Pool", "Sea views", "Car capacity", "Balcony"]}
{"id": "PP00017381", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Qawra", "price": "€1,370,000", "description": "Exceptionally welll located detached bungalow with unobstructive breathtaking views of the open sea. Property is being finished to high specifications with specialised handcrafted works. Layout includes a welcoming hallway, an open plan kitchen/dining/living, 2 large bedrooms with bathroom, main with large walkin, and a jacuzzi, another two bedrooms, 2 main bathrooms, spa with sauna, large library/second living room, swimming pool, BBQ and deck area, carport and much more......", "details": {"Bathrooms": "5"}, "features": ["Shell with Works", "Yard", "Garden", "Own Roof"]}
{"id": "11782", "type": "bungalow", "title": "2 Bedroom Bungalow For Sale in Birguma", "price": "€1,618,000", "description": "Highly finished and ready to move into semi detached bungalow built on a plot of just under 1 tumola. Layout consists of entrance hall, courtyard, sitting/dining, fitted kitchen/dining, bathroom, washroom, 3 double bedrooms, main with ensuite, all rooms leads to a large private back garden with pool. Further complimenting this property is an underlying semi basement 2 large garage ideal for storage and could easily be transferred into a 2 bedroom flatlet For more information call Marise 7927 8517", "details": {}, "features": []}
{"id": "W-01UIRW", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,350,000", "description": "Newly built fully detached BUNGALOW with basement built on over than 1 tumolo, consisting of: - a huge kitchen / dining / living overlooking a sea horizon infinity pool with guaranteed sea and valley views up to Gozo - 3 double bedrooms all with en suite and walk in wardrobe - guest toilet - very big pool deck and barbecue area. This unique Bungalow has a 3 car street level garage. Property is compromised with over of 500sqm garden and a 2 car port. Property is being sold in shell form or with the possibilty to choose finishings standards once still under construction.", "details": {"Size": "450sqm", "Bathrooms": "3"}, "features": ["Garage", "Tiles", "Swimming pool", "AC", "Basement", "Garden", "Balcony", "Sea/lake view"]}
{"id": "W-01DVQV", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Zebbiegh", "price": "€2,000,000", "description": "Malta, luxury real estate! This luxurious bungalow newly built fully detached bungalow for sale is set in an open countryside enjoying breath taking views and full of natural light. This bungalow for sale boasts a modern design and a lavish 300sqm accommodation area. The luxurious property for sale comes in the form: An Open plan kitchen/living/dining room area overlooking the garden 3 double bedrooms Laundry/storage room A large semi basement which can be turned into a flat-let. A lovely bungalow for sale for the discerning client! This lovely real estate property is one of a kind especially on the island of Malta. Call us for a viewing.", "details": {"Size": "380sqm", "Bathrooms": "4"}, "features": ["Marble", "Swimming pool", "AC"]}
{"id": "240071077-54", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€1,600,000", "description": "Brand New highly finished Sea Front Bungalow situated in the most sought after area of Marsaskala. Accommodation consists of a bright and spacious living room, kitchen / dining of which both rooms overlook the swimming pools and sea, 3 double bedrooms, main bathroom, en-suite, laundry room and courtyard which brightens up all the rooms. Complimenting this fantastic property is a basement which can be turned in many ways according to purchaser's needs. Call for an appointment.", "details": {"Size": "589sqm", "Bathrooms": "2"}, "features": ["Central Courtyard", "Roof (Full)", "Swimming Pool", "New Building", "Near Beach", "Near Public Transportation", "Sea Front", "Basement Garage"]}
{"id": "3269804", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,900,000", "description": "Bungalow - Mellieha. Fully detached bungalow in Mellieha with the wide facade. Located in a prestigious area with breathtaking sea and country views. Entrance is very nice and wide leading into a glass roofed leading to kitchen with views, sitting/living room which are split with a interconnecting fireplace to both sides of the rooms with a full stunning sea view, study, bathroom, good size box room, a very nice large bathroom with dual sinks and large corner bath, 3 double bedrooms and en suite. Property also enjoys surrounding gardens with a superb swimming pool and entertaining area with full kitchen facilities with a professional pizza wood oven, shower and guest toilet. Air condition throughout property.", "details": {"Bathrooms": "3"}, "features": []}
{"id": "PP00014707", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,590,000", "description": "MELLIEHA - Magnificent fully detached BUNGALOW situated at Tal- Kortin area with views of Selmun, Comino and Gozo. Built on rocky grounds and on a plot area of 1000sqm, surrounded by a well kept garden, 6 car drive-in and large pool with BBQ and entertaining area. Property consists of an entrance hall, sitting room, three bedrooms (main with en-suite), main bathroom, cinema room and spacious living/kitchen/dining overlooking the pool area with views. Complimenting the property there is a 2 bedroom flatlet. Highly recommended!!", "details": {"Bathrooms": "2"}, "features": ["Luxuriously Finished"]}
{"id": "16805", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Mellieha", "price": "€1,750,000", "description": "This is a luxurious and spacious bungalow located in Santa Marija Estate in Mellieha built on a plot of 1,300 sq. m. and offering views of the bay and the open sea. Access to the property is through the drive-in which takes you to the graciously curved staircase to the house as well as to the 2-car garage on the lower level. This property comprises a sizeable central courtyard, 6 bedrooms (5 of which with ensuite bathroom), lounge, very spacious living room and dining room, kitchen, library and study and a large patio. There is also an underlying one-bedroomed flatlet. It has a well established garden and a sizeable swimming pool with spacious sundeck.", "details": {"Bathrooms": "5"}, "features": []}
{"id": "Bung4129", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Madliena", "price": "€2,000,000", "description": "A fully detached bungalow built on a 1.1 tumolo plot situated in this most sought after area having a very comfortable layout with rooms surrounding a large entrance hall, formal sitting/dining, large living room, seperate kitchen, large study all rooms leading out to a private garden with swimming pool, spacious deck and BBQ area, 3 double bedrooms, ensuite, bathroom and laundry room. Flatlet and garage.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Garden", "Pool", "Car capacity", "Balcony"]}
{"id": "11325", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,550,000", "description": "Luxuriously finished Bungalow, boasting panoramic seaviews, located in the sought after residential area of Santa Marija Estate. Accommodation comprises a kitchen/living/dining, three bedrooms (main with ensuite) and the main bathroom. Complimenting this Property is an underlying garage/full basement, pool and surrounding gardens.", "details": {"Bathrooms": "2"}, "features": ["View", "Open Plan"]}
{"id": "10593", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Iklin", "price": "€1,800,000", "description": "Fully Detached Bungalow set on over 4 tumoli of land, Approx 270 sqm built area comprising of 3 double bedrooms, kitchen, living, dining, sitting, hall, 2 bathrooms, washroom and a large garage with car port.", "details": {"Size": "4965sqm"}, "features": ["Garage", "Garden", "Field", "Ground Floor", "Airspace", "Detached", "Finished", "Whole Roof"]}
{"id": "5035", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€2,000,000", "description": "One of a kind, fully Detached Bungalow situated in one of the best residential areas on the island, offering ample space and luxury for the upmarket client. Layout in the form of entrance hall, formal lounge/dining room, fully fitted kitchen/breakfast room with all modern appliances, pantry, TV room, 4 double bedrooms (main with en suite and closet facilities) and bathroom. Surrounded by terraces and gardens, including a large swimming pool, jacuzzi and sun deck area ideal for leisure and entertaining. 4 car garage at basement level plus workshop area and storage space. An outstandingly bright and welcoming property, fully air conditioned and highly recommended.", "details": {"Bathrooms": "4"}, "features": ["Airconditioning", "Heating"]}
{"id": "Bung4412", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in San Pawl tat Targa", "price": "€2,000,000", "description": "New on the market! Fully detached bungalow built on 1 tumolo of land enjoying tranquil surrounding in this up-market residential area. Property enjoys a wide entrance hall, sitting/dining leading onto a large terrace, kitchen/living leading out to the pool and spacious deck area, 4 double bedrooms, ensuite and bathroom. Underlying is a 4 car garage and flatlet.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Garden", "Basement", "Pool", "Study", "Car capacity", "Balcony"]}
{"id": "PP00014681", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Mellieha", "price": "€1,750,000", "description": "THis is a luxurious Bungalow located in the best area of Mellieha, built on a plot of 1,300sqm and offering views of the bay and the open sea.ACcess to the property is thoough the drive-in which leads you to the beautifully curved staircase of the house, as well as to the 2 car garage at the lower level. This furnished property comprises of a sizeable central courtyard, 6 bedrooms(5 of which with en-suite), lounge, very spaacious living and dining room, kithchen, study, library and a large patio.There is also an underlying flatlet. Complimenting the property one finds a lovely garden and a swimming pool with spacious sun deck.", "details": {"Bathrooms": "6"}, "features": ["Luxuriously Finished", "Yard", "Garden", "Own Roof"]}
{"id": "240121010-539", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,800,000", "description": "SANTA MARIA ESTATE-A magnificent bungalow offered in shell form enjoying sea views. This tranquil resort style hideaway is ideal for anyone after true luxury living guranteed complete comfort and privacy. This wonderful property accomodates three bedroom all with en-suite and master bedroom with walk in wardrobe, a large open plan living /kitche/dining. Lower level has a seperate gym and games room, very large 80sqm pool and adjacent a kitchen/living/dining. All levels enjoy sea views. The property has a three car garage and a surrounding garden. It is built on a tumolo of land 1124sqm.", "details": {"Size": "1124sqm", "Bathrooms": "5"}, "features": ["Swimming Pool", "Shell Form", "Entrance Hall", "Walk in Wardrobe", "Sea View", "Interconnected Garage"]}
{"id": "240121010-819", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Mellieha", "price": "€1,750,000", "description": "SANTA MARIA ESTATE - Definitely one of the finest Detached Bungalow set on high grounds on 950 square metres in this most prominent and extremely sought after location. This spectacular home exudes absolute luxury, wonderful breath taking sea and valley views from most rooms and its sprawling sun terraces, a large swimming pool with ample deck area with shower room and a mature garden. Accommodation comprises wide hall, large sitting room, a glass staircase leading to an open plan sitting room, fully fitted kitchen / breakfast / dining, all three bedrooms ( all with/ shower en-suite and walk -in, also master bedroom enjoys a sauna room, study, bathroom and store room, a two car garage. This house is for the right family who wishes to move in without any hustles what so ever as it is selling as is except for the childrens bedroom, including underlying heating , functional fireplace ,security alarm, 16 panels.", "details": {"Size": "950sqm", "Bathrooms": "4"}, "features": ["Swimming Pool", "Luxury Finish", "Garage", "Interconnected Garage"]}
{"id": "PP00013072", "type": "bungalow", "title": "4 Bedroom Semi-Detached Bungalow For Sale in Mellieha", "price": "€1,537,000", "description": "Luxuriosly furnished 1380 sqm bungalow in Santa Maria Estate enjoying spectacular views and with a large outdoor area, having a well lit sitting/ lounge area, living/ new Fino kitchen with all windows facing views, piano room/ bedroom,guest toilet, another 3 large bedrooms, main with ensuite, bathroom, 4 verandahs, jacuzzi/ bbq area, half a tumolo of land for space for pool, downstairs in the basement there is a large snooker room, and a large 4 bedroom furnished flatlet which can be also split into 2 with different access area, and also communication for an indoor pool. Property has airconditions throughout, marble floor, solid Fino doors, security grills, satariano bathrooms.....A must see !!!!", "details": {"Bathrooms": "4"}, "features": ["Luxuriously Finished"]}
{"id": "Bung3978", "type": "bungalow", "title": " Bungalow For Sale in Mellieha", "price": "€1,500,000", "description": "Highly recommended - SEAFRONT FULLY DETACHED BUNGALOW on two plots with an area of approximately 2,300 square metres and can also have access from 2 roads. This bungalow enjoys rooms of generous proportions most of which have unobstructed sea views. Floor plan comprises an entrance hall, sitting / dining room, fitted kitchen / breakfast, living room, master bedroom with ensuite and walk-in wardrobe, two further bedrooms one also with shower ensuite, guest cloakroom ,laundry room, swimming pool / sundeck area perfect for relaxation or recreational use which is also equipped with a kitchenette whilst surrounded by landscaped grounds and terraces. Underlying this property are a series of storerooms, a one bedroom flatlet all of which can also be accessed from a private driveway leading to a 4-car garage. A truly exceptional home set in the finest and most tranquil residential neighborhoods.", "details": {}, "features": ["Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Roof", "Sea views", "Fireplace"]}
{"id": "PP00006607", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Ta' l-Ibragg", "price": "€1,500,000", "description": "Well kept bungalow with 5 bedrooms (2 en suite bathrooms) main bedroom with walkin wardrobe beautiful kitchen / breakfast, living room, sitting room on split level, dining room games rooom in basement with 2 car garage, lovely pool with plenty of surround and bbq area", "details": {"Bathrooms": "5"}, "features": ["Luxuriously Finished", "Garden", "Own Roof"]}
{"id": "PP00017649", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Attard", "price": "€2,350,000", "description": "Larger than usual detached bungalow situated in a peaceful location set on 2 roads . This property comprises of a large fitted kitchen with breakfast area, dining room, living room, a grand hallway, 3 bathrooms, 3 double bedrooms, 3 car garage plus a 3 car drive way, garden with plenty of fruit trees,2 service rooms, large swimming pool.Fully central heating, Must be seen to be appreciated.", "details": {"Bathrooms": "3"}, "features": ["Luxuriously Finished", "Yard", "Garden", "Own Roof", "Internet"]}
{"id": "PP00017651", "type": "bungalow", "title": "3 Bedroom Detached Bungalow For Sale in Attard", "price": "€2,500,000", "description": "Larger than usual detached bungalow situated in a peaceful location,set in 2 roads . This property comprises a large fitted kitchen with breakfast area, dining room, living room, a grand hallway, 3 bathrooms, 3 double bedrooms, 3 car garage plus a 3 car drive way, garden with plenty of fruit trees,2 service rooms large swimming pool.Fully central heating, Must be seen to be appreciated.", "details": {"Bathrooms": "3"}, "features": ["Luxuriously Finished", "Yard", "Garden", "Own Roof", "Internet"]}
{"id": "Bung8830", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Madliena", "price": "€2,330,000", "description": "An impeccably kept corner fully detached bungalow on over one tumolo enjoying distant unobstructed views comprising entrance into elegant hallway, large combined living room / dining room separate fully fitted kitchen / breakfast area with walk-out onto pool deck. 3 double bedrooms en-suite, main enjoying walk-in wardrobe. All bedrooms lead out onto garden. 3 car lock-up garage and four car drive-way and much, much, more.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Roof", "Sea views", "Fireplace", "Terrace", "Country views", "Utility/boxroom", "Car capacity", "Balcony"]}
{"id": "12475", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Wardija", "price": "€2,200,000", "description": "Newly built Detached Bungalow set in open countryside enjoying breathtaking views and full of natural light. Boasting a modern design, lavish 300sqm accommodation exudes luxury and comfort. Property comprising of a large entrance hall, open plan kitchen / living / dinig room overlooking the garden and pool area, 3 double bedrooms (all with ensuite facilities), laundry / storage room, a large semi basement area which can be utilised as a flatlet, games room and more, underlying 6 car garage. further complimenting this lovely property is a private swimming, surrounding gardens and terraces enjoying lovely country views. A one off property for the discerning client! Freehold", "details": {"Size": "300sqm", "Bathrooms": "3"}, "features": ["View", "Garage"]}
{"id": "240071087-97", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Birguma", "price": "€1,500,000", "description": "Birguma - This excellently designed semi detached bungalow is situated on high grounds in a sought after area, built on an area of 510sqm and enjoys ample outdoor space. Accomodation comprises a wide entrance hall an open plan kitchen/living/dining area leading onto a large terrace overlooking the pool deck area and the garden. Three good size double bedrooms main ensuite a study and a guest bathroom. At semi-basement level one finds a six-car garage a laundry room a bathroom and a 54sqm games room and gym. Property is to be sold in shell form.", "details": {"Size": "510sqm", "Bathrooms": "3"}, "features": ["Air Space", "Central Courtyard", "Deck", "Front Patio", "Garden", "Roof (Full)", "Terrace", "Well", "Shell Form", "New Building", "Entrance Hall", "5+ Car Garage", "Interconnected Garage", "Street Level Garage"]}
{"id": "Bung11617", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€2,350,000", "description": "A very well kept, detached bungalow, set on approximately 1,350sqm situated in one of the most elite locations of Bahar ic-Caghaq. Spacious accommodation is in the form of a large entrance hall, lounge, dining room, fitted kitchen / breakfast / living, 3 bedrooms and 2 bathrooms (one of which is an en-suite). This attractive residence further comprises a mature garden, swimming pool with ample deck area, games room, kitchenette and a 4 car drive-in leading to a 4 car garage.", "details": {"Bathrooms": "2"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Garden", "Pool"]}
{"id": "PP00007146", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Mellieha", "price": "€2,300,000", "description": "This is a luxurious bungalow built on a plot of 1,300 sq m and offering views of the bay and the open sea. through the drive-in which takes you to the graciously curved staircase to the house as well as to the 2-car garage on the lower level.This furnished property comprises a sizeable central courtyard, 6 bedrooms (5 of which are ensuite), lounge, very spacious living room, and dining room, kitchen, library and study and a large patio. There is also an underlying one-bedroomed flatlet. It has a well established garden and a sizeable swimming pool with spacious sundeck.", "details": {"Bathrooms": "5"}, "features": ["Luxuriously Finished"]}
{"id": "12259", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Marsascala", "price": "€3,200,000", "description": "A recently built and designer finished sea front bungalow enjoying magnificent views. Layout comprises of an entrance hall, large open plan fitted kitchen/breakfast/dining/living, guest toilet and three bedrooms (all of which have en-suite facilities).  This top of the range residence also comprises an outdoor swimming pool overlooking the Marsaskala promenade, a kitchenette, an office, an internal courtyard and a fifteen-car garage at semi-basement level.", "details": {"Size": "740sqm"}, "features": ["Swimming Pool", "Sea View", "Terrace", "Balcony", "Yard", "Lift", "Garage", "Town View", "Furnished", "Air Conditioning", "Washing Machine", "LCD TV", "Internet", "Study", "Utility Room", "Freehold"]}
{"id": "16498", "type": "bungalow", "title": "5 Bedroom Bungalow For Sale in Gharghur", "price": "€3,000,000", "description": "Beautiful bungalow with fabulous views with unspoilt valley and seaviews stretching for 1.7 KM. This property comprises of five bedrooms leading onto terrace and pool area, three bathrooms with ensuite in main bedroom.Guest toilet, large entrance hall, spacious living room leading onto terrace, dining room.Fully integrated kitchen.Laundry room. Spectacular pool area with fitted turf, great for entertaining, leading to a large mature garden with a selection of fruit trees and vines and a rose garden with irrigation system.Fully sized tennis court.Flat-let available including bathroom , kitchenette and living room with a private internal access to the house. Garages fitting 7 cars at street level. Games room.", "details": {"Size": "2000sqm", "Bathrooms": "3"}, "features": []}
{"id": "Bung5588", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€2,300,000", "description": "Set on approximately 2000 sqm, is this fully detached corner Bungalow enjoying fantastic sea and country views from its surrounding front terraces, with a large pool and spacious garden. Accomodation comprises of an entrance hall, formal sitting / dining, living room, kitchen / breakfast, 3 bedrooms and bathroom. At basement level one finds an underlying flatlet. Complimenting the property is two garages at street level, and a private drive in. Has potential to be developed into 2 villas.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Garden", "Basement", "Pool", "Sea views", "Terrace", "Flatlet", "Country views", "Utility/boxroom"]}
{"id": "W-01DVQQ", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Wardija", "price": "€2,200,000", "description": "Malta, luxury real estate! This luxurious newly built fully detached bungalow for sale is set in an open countryside enjoying breath taking views and full of natural light. This bungalow for sale boasts a modern design and a lavish 300sqm accommodation area. This luxurious property for sale comes in the form of: A large entrance hall An open plan kitchen/living/dining room area overlooking the Garden and pool area 3 double bedrooms (all with ensuite facilities) Laundry/storage room A large semi basement which can be turned into a flat-let Games and cinema room Underlying 6 car garage Further complimenting this lovely property is a private swimming, Surrounding gardens and terraces enjoying lovely country views. A lovely bungalow for sale for the discerning client! This lovely real estate property is one of a kind especially on the island of Malta. Call us for a viewing", "details": {"Size": "380sqm", "Bathrooms": "4"}, "features": ["Marble", "Swimming pool", "AC", "Basement", "Garden", "Balcony", "Built-in Kitchen"]}
{"id": "FDB6857", "type": "bungalow", "title": " Bungalow For Sale in Balzan", "price": "€3,000,000", "description": "The history and allure of this majestic property is absolutely unbelievable. During the early 17th century, Grand Master Antoine de Paule of the Order of St. John commissioned the building of another fully detached bungalow featuring a high walled garden in close proximity to his residence, the Palace of San Antonio. Legend has it, that this estate was entered by crossing a short footbridge from this very garden spanning from the main Palace. A secret underground tunnel was also discovered which served as an emergency escape route for the Grand Master. Therefore, this one of kind property may have ultimately played a role in the protection of the grand master De Paule. This villa has also survived two world wars and has remained practically unchanged with only some minor modification and art deco styling. It is presumed that the garden has also kept most of its original features. In fact, an extremely old Norfolk Island Pine stands as the centre piece of the protected garden reflecting the ages gone by. The first ever recorded wedding reception held at the Villa took place in 1944. Today, the villa and its glorious history proudly offer the style and charm for an elegant wedding and special events venue. The estate covers 2000 sqm and is fully licensed for commercial purposes.", "details": {"Size": "500sqm", "Bathrooms": "2"}, "features": []}
{"id": "Bung9472", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Rabat", "price": "€3,500,000", "description": "A brand new state of the art bungalow set in a unique location in the beautiful countryside of Buskett, built to the highest specifications and surrounded by amazing country views. This property lies over 2000sqm of land and 400sqm being the built area. This bungalow features LED and intelligent lightning, state-of-the-art underfloor heating, marble and stucco finishes, beautiful terrace overlooking the large pool and extensive garden featuring 300 year old Spanish olive trees and a fully automated irrigation system. Internally, the property has been designed to offer the utmost of comfort and functionality. On entering the property, one will find a comfortable reception area leading onto a large living room, sizeable kitchen and dining room all overlooking great views and a generous patio. On this level one also finds 3 double bedrooms all with en-suite, main having a full bath and shower. On the same level, one will also find a guest-toilet, pantry as well as a kitchen. On the upper level, a library/study or additional bedroom with a terrace overlooking the garden and magnificent countryside views of Buskett. At basement level, a large games room, wine cellar, relaxation area and sauna. A spiral staircase from the basement level leads to the deck area. Property also boasts a one car garage with patio and drive which may take an additional 7 cars. A must be seen!", "details": {"Bathrooms": "5"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Roof", "Fireplace", "Terrace", "Country views", "Utility/boxroom"]}
{"id": "W-02111W", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€3,200,000", "description": "This property for sale in Malta is a luxurious bungalow situated on the seafront enjoying 180 degrees of beautiful Mediterranean Sea views. This property for sale in Malta is one of the few houses which enjoy such a privileged position. Apart from enjoying spectacular water view, this blue ribbon address is a designer home which definitely emphasize its wow factor. The kitchen has everything a connoisseur of fine living might desire and is also accompanied by impressive living and dining areas. This property for sale in Malta comes in the form of: A very spacious living room A kitchen which overlooks the pool and barbecue area 3 double bedrooms with one having a master en-suite A main bathroom A spacious 13-car garage. The bungalow comes with a secure basement parking with internal lift access. On the roof one can enjoy unobstructed views of the Mediterranean Sea. If the best of everything is your way of life, you've just found your new home. Call us today to view this exceptional property!", "details": {"Size": "525sqm", "Bathrooms": "3"}, "features": ["Garage", "Cook Top", "Marble", "Fireplace", "Elevator", "Terrace", "Alarm system", "Swimming pool", "AC", "Basement", "Guest toilet", "Waterfront", "Sea/lake view", "Built-in Kitchen", "Cook Top"]}
{"id": "Bung9309", "type": "bungalow", "title": "8 Bedroom Bungalow For Sale in St Paul's Bay", "price": "€3,000,000", "description": "A fully finished detached bungalow on 4 floors, on a tumolo of land. Set in a most sought after location enjoying outstanding unobstructed country and sea views. Property comprises entrance into a large hallway, 3 double bedrooms with en-suites, formal dining/living, separate kitchen/breakfast leading out onto a large central courtyard, perfect for entertaining. On the lower floor 3 bedroom flat let with separate entrance, large games room and a 5 car lock-up garage. On the third floor another 3 bedroom flat let, 2 very large rooms being utilised as a wood and steel workshop. On the fourth floor an internal pool which leads out onto a BBQ area and mature gardens. A must be seen!", "details": {"Bathrooms": "6"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Yard", "Garden", "Basement", "Pool", "Study", "Roof", "Sea views", "Flatlet", "Country views", "Utility/boxroom"]}
{"id": "14433", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€2,555,000", "description": "this much sought after location, this property enjoys privacy and tranquility, layout comprises of an imposing entrance hall with stone to heat up all the house, fitted kitchen/living/dining leading to a large terrace with views, 4 double bedrooms, bathroom, ensuite, underlying 9 car garage + granny's flatlet. This Bungalow has surrounding garden, a large pool, deck area with kitchenette, shower, guest toilet. A beautiful home !l For more information call Marise 7927 8517", "details": {}, "features": []}
{"id": "W-01CV2W", "type": "bungalow", "title": "6 Bedroom Bungalow For Sale in Gharghur", "price": "€2,900,000", "description": "A beautiful villa for sale over looking sea and country views in an exceptional area of Gharghur built on two tumuli of land in a very quiet and tranquil area! This outstanding villa for sale boasts of a: Grand hall Dining room Kitchen / dining Laundry room Living room Bathroom Study or sixth bedroom 5 double bedrooms En suite Walk in wardrobes underlying flat let. Large swimming pool with large deck area Tennis court Full alarm system Five car ports 8 car garages Large garden area. This villa for sale, a true gem on the island of Malta! Please contact now for a viewing, or come by in one of our lounges located on the island of Malta.", "details": {"Size": "550sqm", "Bathrooms": "4"}, "features": ["Garage", "Parquet", "Tiles", "Terrace", "Alarm system", "Guest apartment", "jacuzzi", "Swimming pool", "AC", "Basement", "Tennis court", "Guest toilet", "Garden", "Sea/lake view"]}
{"id": "Bung7884", "type": "bungalow", "title": "4 Bedroom Bungalow For Sale in Bahar Ic-Caghaq", "price": "€2,800,000", "description": "Nestled just beneath Madliena valley, is this fully detached bungalow, with a large swimming pool area with ample space for entertaining, a surrounding garden and drive-in. Accommodation comprises of a large entrance hall, spacious sitting room, separate dining room, kitchen / breakfast with larder room / laundry, 4 bedrooms main with ensuite and walk-in wardrobe and a main bathroom. Property also includes a 2 car lock-up garage.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Laundry", "Garden", "Pool", "Study", "Utility/boxroom", "Car capacity"]}
{"id": "Bung6123", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Zebbiegh", "price": "€2,200,000", "description": "A luxuriously finished elevated bungalow set on approximately 1250sqm of land, enjoying spectacular country views situated on the limits of Wardija with a large swimming pool, back and front garden, drive-in and a 6 car garage. Accommodation comprises a welcoming entrance hall, spacious sitting / dining room overlooking the pool area, kitchen / breakfast, living room & guest toilet. 3 double bedrooms all ensuite bathrooms, main with walk-in wardrobe and outdoor terrace. Property is complimented by a huge semi basement / flatlet and a 6 car garage. Extremely highly finished including marble flooring, wooden windows and enjoying a very bright and spacious layout.", "details": {"Bathrooms": "1"}, "features": ["Garage", "Sitting", "Dining", "Living", "Kitchen", "Breakfast", "Garden", "Basement", "Pool", "Study", "Terrace", "Flatlet", "Country views", "Car capacity"]}
{"id": "12474", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Wardija", "price": "€2,200,000", "description": "Newly built Detached Bungalow set in open countryside enjoying breathtaking views and full of natural light. Boasting a modern design, lavish 300sqm accommodation exudes luxury and comfort. Property comprising of a large entrance hall, open plan kitchen / living / dinig room overlooking the garden and pool area, 3 double bedrooms (all with ensuite facilities), laundry / storage room, a large semi basement area which can be utilised as a flatlet, games room and more, underlying 6 car garage. further complimenting this lovely property is a private swimming, surrounding gardens and terraces enjoying lovely country views. A one off property for the discerning client! Freehold", "details": {"Size": "300sqm", "Bathrooms": "3"}, "features": ["View", "Garage"]}
{"id": "240071071-94", "type": "bungalow", "title": "3 Bedroom Bungalow For Sale in Marsascala", "price": "€2,660,000", "description": "Detached bungalow comprising a wide entrance hall, kitchen / dining, formal sitting room, office, 3 bedrooms with en-suites and an interconnected 2 car garage with private drive. All rooms are overlooking the surrounding garden. Enjoying beautiful sea and country views.", "details": {"Size": "1040sqm", "Bathrooms": "2"}, "features": ["Air Space", "Front Patio", "Roof (Full)", "Needs Renovation", "Sea Front", "2 Car Garage"]}
